{
  "0": {
    "Abstract": "Historical financial data are frequently used in technical analysis to identify patterns that can be exploited to achieve trading profits. Although technical analysis using a variety of technical indicators has proven to be useful for the prediction of price trends, it is difficult to use them to formulate trading rules that could be used in an automatic trading system due to the vague nature of the rules. Moreover, it is challenging to determine a specified combination of technical indicators that can be used to detect good trading points and trading rules since different stock may be affected by different set of factors. In this paper, we propose a novel trading point forecasting framework that incorporates a bicluster mining technique to discover significant trading patterns, a method to establish the fuzzy rule base, and a fuzzy inference system optimized for trading point prediction. The proposed method (called BM-FM) was tested on several historical stock datasets and the average performance was compared with the conventional buy-And-hold strategy and five previously reported intelligent trading systems. Experimental results demonstrated the superior performance of the proposed trading system. © 1993-2012 IEEE.",
    "Affiliations": "School of Mechanical Engineering, Center for Optical Imagery Analysis and Learning, Northwestern Polytechnical University, Xi'an, China; School of Electronic and Information Engineering, South China University of Technology, Guangzhou, China; School of Information and Communication Technology, Gold Coast Campus, Griffith University, Gold Coast, QLD, Australia; School of Computer Science, Center for Optical Imagery Analysis and Learning, Northwestern Polytechnical University, Xi'an, China",
    "Author Keywords": "Biclustering; fuzzy inference system; particle swarm optimization; technical analysis; trading point prediction; trading rules",
    "Author(s) ID": "7403634614;57214920886;57193209101;7005648281;55936260100;",
    "Authors": "Huang Q., Yang J., Feng X., Liew A.W.-C., Li X.",
    "Cited by": 1,
    "DOI": "10.1109/TFUZZ.2019.2904920",
    "Document Type": "Article",
    "EID": "2-s2.0-85067862019",
    "Index Keywords": "Commerce; Forecasting; Fuzzy rules; Particle swarm optimization (PSO); Automated trading; Bi-clustering; Buy-and-hold strategy; Fuzzy inference systems; Mining techniques; Technical analysis; Technical indicator; Trading rules; Fuzzy inference",
    "Issue": "2",
    "Page end": 272.0,
    "Page start": 259.0,
    "Source title": "IEEE Transactions on Fuzzy Systems",
    "Title": "Automated trading point forecasting based on bicluster mining and fuzzy inference",
    "Volume": "28",
    "Year": 2020
  },
  "1": {
    "Abstract": "Ever since the advent of the financial industry, experts have attempted to create systems to track and analyze trends in the stock market. These systems have not suitably predicted future trends, limiting the advice given to consumers. Expert opinions are subject to human error and personal bias, which can potentially lead to financial losses to the consumer. Thus, a system devoid of personal bias, providing an accurate prediction is highly beneficial to the consumer, the broker and the corporations involved in financial markets. Such a system, coupled with the automatic trading system, will optimize transactions leading to overall economic growth. The proposed system performs as a basic I/O system. The input is the historical market data, and the stock to be predicted. The output is the recommendation on whether to buy or sell the stock and supplemental graphs to aid the consumer. The key modules of the system are the capture, analysis, search and visualisation modules. These feed into the prediction module, which uses the concept of mining based Artificial Neural Networks (ANN) to provide a reliable recommendation. Finally, all these modules represented to the consumer with webpage based convenient format via home screen. © 2019 IEEE.",
    "Affiliations": "School of Management Engineering, Zhengzhou University, Zhengzhou, China; Vellore Institute of Technology, Department of Software System, Vellore, India",
    "Author Keywords": "Artificial neural network; Prediction; Stock market; Technical analysis",
    "Author(s) ID": "25627427700;57214999067;57215000456;57199019471;",
    "Authors": "Cai Y.-L., Kannan K., Xie Y.-H., Zhao L.",
    "Cited by": 0,
    "DOI": "10.1109/IEEM44572.2019.8978597",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85079625568",
    "Index Keywords": "Commerce; Financial markets; Forecasting; Losses; Neural networks; Accurate prediction; Economic growths; Expert opinion; Financial industry; Financial loss; Stock market analysis; Technical analysis; Trading systems; Electronic trading",
    "Issue": null,
    "Page end": 1108.0,
    "Page start": 1104.0,
    "Source title": "IEEE International Conference on Industrial Engineering and Engineering Management",
    "Title": "E-Commerce: Stock Market Analysis Blended with Mining and Ann",
    "Volume": null,
    "Year": 2019
  },
  "10": {
    "Abstract": "Trading strategies intended for high frequency trading in Forex markets are executed by cutting-edge automated trading systems. Such systems implement algorithmic trading strategies and are configured with predefined optimized parameters in order to generate entry and exit orders and execute trades on trading platforms. Three high-frequency automated trading systems were developed in the current research, using the MACD (oscillator), the SMA (moving average) and the PIVOT points (price crossover) technical indicators. The systems traded on hourly time frames, employing historical data of closing prices and the parameter optimization for each system was done using the d-Backtest PS method over weekly periods. With this work we intend to extend the methods of parameter selection for automated trading systems in high frequency trading. Through this research and the interpretation and evaluation of its results, we conclude that backtesting parameters’ optimization, especially through the d-Backtest PS method, is much more profitable than the default values of the parameters and that the optimization of parameters yields the highest profits through the implementation of restrictive relationships among them. It is also observed that the selection of the most profitable parameters of a trading system can be unrestricted, rendering the validation of the minor divergence occurring among slightly varying prices redundant. Meanwhile, other conclusions that can be drawn are that the most profitable classification system employed by the d-Backtest PS method is calibrated by means of two validation periods and that the most efficient profitability ratio between historical data period and validation period is 6:1 (in- and out-of-the-sample ratio). © 2019, Springer Science+Business Media, LLC, part of Springer Nature.",
    "Affiliations": "Department of Electrical and Computer Engineering, Democritus University of Thrace, Xanthi, 67100, Greece; COSMOS4U, Xanthi, 67100, Greece",
    "Author Keywords": "Backtesting optimization algorithms; d-Backtest PS method; Exchange rates (AUDUSD, EURUSD, GBPUSD, USDCAD, USDJPY); Expert backtesting systems; Forex; MACD; Metals (XAUUSD); Optimal historical data period selection; PIVOT; SMA",
    "Author(s) ID": "57201077778;6602792529;57208386174;57212505796;57212503600;",
    "Authors": "Vezeris D.T., Schinas C.J., Kyrgos T.S., Bizergianidou V.A., Karkanis I.P.",
    "Cited by": 0,
    "DOI": "10.1007/s10614-019-09956-1",
    "Document Type": "Article",
    "EID": "2-s2.0-85076888105",
    "Index Keywords": null,
    "Issue": null,
    "Page end": null,
    "Page start": null,
    "Source title": "Computational Economics",
    "Title": "Optimization of Backtesting Techniques in Automated High Frequency Trading Systems Using the d-Backtest PS Method",
    "Volume": null,
    "Year": 2019
  },
  "100": {
    "Abstract": "The aim of this study is to predict automatic trading decisions in stock markets. Comprehensive features (CF) for predicting future trend are very difficult to generate in a complex environment, especially in stock markets. According to related work, the relevant stock information can help investors formulate objects that may result in better profits. With this in mind, we present a framework of an intelligent stock trading system using comprehensive features (ISTSCF) to predict future stock trading decisions. The ISTSCF consists of stock information extraction, prediction model learning and stock trading decision. We apply three different methods to generate comprehensive features, including sentiment analysis (SA) that provides sensitive market events from stock news articles for sentiment indices (SI), technical analysis (TA) that yields effective trading rules based on trading information on the stock exchange for technical indices (TI), as well as the trend-based segmentation method (TBSM) that raises trading decisions from stock price for trading signals (TS). Experiments on the Taiwan stock market show that the results of employing comprehensive features are significantly better than traditional methods using numeric features alone (without textual sentiment features). © 2014 Elsevier B.V.",
    "Affiliations": "Innovation Center of Big Data and Digital Convergence, Yuan Ze University, Taoyuan, Taiwan",
    "Author Keywords": "Comprehensive features; Intelligent stock trading; Sentiment analysis; Technical analysis",
    "Author(s) ID": "36816648000;35235928000;56122892000;",
    "Authors": "Wu J.-L., Yu L.-C., Chang P.-C.",
    "Cited by": 18,
    "DOI": "10.1016/j.asoc.2014.06.010",
    "Document Type": "Article",
    "EID": "2-s2.0-84903639947",
    "Index Keywords": "Data mining; Forecasting; Investments; Complex environments; Comprehensive features; Intelligent stock trading system; Segmentation methods; Sentiment analysis; Stock trading; Taiwan stock markets; Technical analysis; Commerce",
    "Issue": null,
    "Page end": 50.0,
    "Page start": 39.0,
    "Source title": "Applied Soft Computing Journal",
    "Title": "An intelligent stock trading system using comprehensive features",
    "Volume": "23",
    "Year": 2014
  },
  "101": {
    "Abstract": "In the last few years, the financial industry has witnessed a growing demand for an integrated multi-asset, multi-strategy trading system that allows traders to simultaneously trade different types of assets, and provides real-time risk assessments, status, and performance of the diversified portfolio. However, many factors contribute to the complexity of developing such integrated decision-making systems. Some of these factors include: the inherent diversity of financial assets, the heterogeneity of trading and risk assessment strategies, and the highly dynamic nature of financial markets. Moreover, the large volume of data to be analyzed severely affects the system's ability to make timely decisions, especially, for high-frequency trading. This paper proposes a novel Holonic Intelligent Multi-Agent Algorithmic Trading System (HIMAATS) to address the software functional requirements (multi-asset, multi-strategy, real-time risk assessment, etc.), and non-functional requirements (autonomy, high-throughput, low-latency, modularity, scalability, etc.).",
    "Affiliations": "Electrical and Computer Eng. Dep., University of Waterloo, 200 University Avenue, West Waterloo, ON N2L 3G1, Canada",
    "Author Keywords": "Algorithmic Trading Systems; Holonic Systems; MultiAgent Systems",
    "Author(s) ID": "56039485400;7004108940;",
    "Authors": "Abdunabi T., Basir O.",
    "Cited by": 0,
    "DOI": null,
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84894212316",
    "Index Keywords": null,
    "Issue": null,
    "Page end": 72.0,
    "Page start": 67.0,
    "Source title": "22nd International Conference on Software Engineering and Data Engineering, SEDE 2013",
    "Title": "An integrated multi-asset, multi-strategy algorithmic trading system",
    "Volume": null,
    "Year": 2013
  },
  "103": {
    "Abstract": "This work proposes a new automated trading system (ATS) architecture that supports multiple strategies for multiple market conditions through hierarchical trading signals generation employing h-signals, which are trading signals that are generated using other trading signals. The central idea of the proposed system architecture is to decompose the trading problem into a set of tasks handled by distributed autonomous agents under a minimal central coordination. We implemented the proposed ATS using a software architecture that employed a publish/subscribe communication model. In the current stage of development, we are able to run our ATS in back-test mode with moving-average crossover strategies on minute-by-minute market databases. We achieved very satisfactory performance results, processing 306.791 database rows representing more than two years of data in only 47 seconds. © 2013 ACM.",
    "Affiliations": "Receita Federal Do Brasil, Pietrângelo de Biase 56/308, 29.010-190, Vitória E.S., Brazil; DI, UFES, Av. Fernando Ferrari, 514, 29075-910, Vitória E.S., Brazil",
    "Author Keywords": "algorithmic trading; automated trading systems (ATS); stock markets; system and software architectures",
    "Author(s) ID": "26323590700;55983390200;55425796800;",
    "Authors": "Freitas F.D., Freitas C.D., De Souza A.F.",
    "Cited by": 2,
    "DOI": "10.1145/2535557.2535563",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84891517121",
    "Index Keywords": "Algorithmic trading; Automated trading systems; Communication modeling; Crossover strategies; Online optimization; Signals generation; Stock market; System architectures; Automation; Autonomous agents; Software architecture; Commerce",
    "Issue": null,
    "Page end": null,
    "Page start": null,
    "Source title": "Proceedings of WHPCF 2013: 6th Workshop on High Performance Computational Finance - Held in Conjunction with SC 2013: The Int. Conf. for High Performance Computing, Networking, Storage and Analysis",
    "Title": "System architecture for on-line optimization of automated trading strategies",
    "Volume": null,
    "Year": 2013
  },
  "104": {
    "Abstract": "For the better part of the last four decades academic research has focused on stock return predictability explained by asset pricing models. Financial economists approach finance theory by focusing on whether to reject a pricing model based on hypothesis tests. However, this approach often fails to capture aspects of the model and latent information in the data that could be potentially useful to the investor. Owing to these limitations, investors have increasingly turned to high-frequency trading as a means of achieving risk-mitigated wealth appreciation. High frequency trading is a strategy that relies on professional proprietary formula-driven trading algorithms to execute millisecond trades using high-speed computers that are placed near or in the proximity of the exchanges to reduce order latency time. The contemporary impact of this new approach has increased the speed and complexity of trading, and has had an impact on market liquidity and transparency. In turn, this has attracted the attention of regulators who are \"Clamping Down on Rapid Trades in the Stock Market\" [3] and the risk of such trades to create volatility by flooding the market with orders before canceling these same orders in fractions of seconds. Facing the possibility of regulatory oversight, many highfrequency automated traders are now turning to the alternative of near high-frequency trading. Instead of focusing on strategies to implement strategic runs in the millisecondenvironment, using the highest resolution data available, near high-frequency trading solves complex econometric models on an instrument by instrument basis to predict the profitability of a future trade. In this paper we present a theory of stochastic price formation to form a behavioral near high frequency automated trading system. The new system is actuated by a combining dual radial basis function artificial neural networks and two fundamental trading metrics. Additionally, because the trading signals are generated by cognitive models, the research calibrates a nonparametric behavioral production function to estimate the quasi elasticity coefficients of a four factor model. © 2013 by Nova Science Publishers, Inc. All rights reserved.",
    "Affiliations": "NKD-Group Inc, United States; Department of Computer Science and Statistics, University of Rhode Island, Kingston, RI, United States; Department of Finance, University of Exeter, United Kingdom; Thomson Reuters, United States",
    "Author Keywords": "Automated trading; Cognitive science; Neuroeconomics; Production theory",
    "Author(s) ID": "8692916900;56069025500;",
    "Authors": "Kajiji N., Forman J.",
    "Cited by": 1,
    "DOI": null,
    "Document Type": "Book Chapter",
    "EID": "2-s2.0-84896160618",
    "Index Keywords": null,
    "Issue": null,
    "Page end": 73.0,
    "Page start": 53.0,
    "Source title": "Recent Advances in Computational Finance",
    "Title": "Production of efficient wealth maximization using neuroeconomic behavioral drivers and continuous automated trading",
    "Volume": null,
    "Year": 2013
  },
  "106": {
    "Abstract": "This chapter proposes a hybrid high-frequency trading application based on a Type-2 Fuzzy Logic approach combined with Hilbert transforms for the detection of periodicities in high-frequency FX data. Most trading systems have concentrated on using common analytic waveforms and have not taken into consideration phasors and complex variables. The Hilbert transform, often employed to convert signal variables in analytic waveforms to complex variables, will be used for the measurement of market cycles, rather than measurement of market trends. The main objective is to investigate how the periods of the dominant cycle in a cycle mode can be quantified in order to create an amplitude compensation of the In-Phase and Quadrature components, alongside methods of smoothing and de-trending the analytic signal. The subsequent output can be defuzzified using Type 2 Fuzzy-Logic techniques, which will in turn refine the implementation of trading strategies. Type-2 Fuzzy Logic systems are becoming more popular as they account for uncertainties that are not captured within a Type-1 Fuzzy Logic system. These Type-2 systems outperform traditional Fuzzy Logic systems in forecasting problems since they can account for more variables in a more efficient way. © 2013 by Nova Science Publishers, Inc. All rights reserved.",
    "Affiliations": "Department of Banking and Finance, Faculty of Economics Management and Accountancy, University of Malta, Malta; Centre for Computational Finance and Economic Agents (CCFEA), University of Essex, United Kingdom",
    "Author Keywords": null,
    "Author(s) ID": "35748889300;24401964100;",
    "Authors": "Kablan A., Ng W.L.",
    "Cited by": 0,
    "DOI": null,
    "Document Type": "Book Chapter",
    "EID": "2-s2.0-84896157622",
    "Index Keywords": null,
    "Issue": null,
    "Page end": 52.0,
    "Page start": 29.0,
    "Source title": "Recent Advances in Computational Finance",
    "Title": "High-frequency trading with type-2 fuzzy logic time series forecasting and hilbert transforms",
    "Volume": null,
    "Year": 2013
  },
  "107": {
    "Abstract": "Research on automated systems for Stock price prediction has gained much momentum in recent years owing to its potential to yield profits. In this paper, we present an automatic trading system for Nifty for deciding the buying and selling calls for intra-day trading that combines various methods to improve the quality and precision of the prediction. Historical data has been used to implement the various technical indicators and also to train the Neural Network that predicts movement for intra-day Nifty. Further, Sentiment Analysis techniques are applied to popular blog articles written by domain experts and to user comments to find sentiment orientation, so that analysis can be further improved and better prediction accuracy can be achieved. The system makes a prediction for every trading day with these methods to forecast if next day will be a positive day or negative. Further, buy and sell calls for intra-day trading are also decided by the system thus achieving full automation in stock trading. © 2013 IEEE.",
    "Affiliations": "Department of Information Technology, National Institute of Technology, Karnataka, Surathkal, India",
    "Author Keywords": "Neural Network; Sentiment analysis; Stock price prediction; Technical analysis",
    "Author(s) ID": "56045691400;57212454617;",
    "Authors": "Bhat A.A., Kamath S.S.",
    "Cited by": 4,
    "DOI": "10.1109/ICCCNT.2013.6726675",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84894477908",
    "Index Keywords": null,
    "Issue": null,
    "Page end": null,
    "Page start": null,
    "Source title": "2013 4th International Conference on Computing, Communications and Networking Technologies, ICCCNT 2013",
    "Title": "Automated stock price prediction and trading framework for Nifty intraday trading",
    "Volume": null,
    "Year": 2013
  },
  "110": {
    "Abstract": "This paper reports on an expert advisor for forex trading based on Back Propagation Neural Network (BPNN) in MetaTrader4 platform. A single hidden layer feedforward network was established for foreign exchange rate prediction. Trading rules based on the prediction results was designed and realized. Finally, we optimized the parameters according to the profitability performed on EUR/USD, GBP/USD currency pairs separately. The optimized results are able to achieve good results in the training series. In the test series, the strategies are consistently profitable for at least the first twenty days. It is concluded that the BPNN based model do have the ability to make profits from the experimental currency pairs for the period investigated. © (2013) Trans Tech Publications, Switzerland.",
    "Affiliations": "Management Department, Xiamen University, China",
    "Author Keywords": "Expert advisor; Foreign exchange; Metatrader 4; Neural networks; Trading system",
    "Author(s) ID": "56224311600;57191648867;",
    "Authors": "Meng L., Sun Y.",
    "Cited by": 2,
    "DOI": "10.4028/www.scientific.net/AMR.753-755.3080",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84884826424",
    "Index Keywords": "Back-propagation neural networks; BP neural networks; Expert advisor; Feed-forward network; Foreign exchange; Foreign exchange rates; Metatrader 4; Trading systems; Economics; Network layers; Neural networks; Optimization; Profitability; Commerce",
    "Issue": null,
    "Page end": 3083.0,
    "Page start": 3080.0,
    "Source title": "Advanced Materials Research",
    "Title": "Research on automated forex trading system based on BP neural network",
    "Volume": "753-755",
    "Year": 2013
  },
  "112": {
    "Abstract": "Recurrent reinforcement learning (RRL), a machine learning technique, is very successful in training high frequency trading systems. When trading analysis of RRL is done with lower frequency financial data, e.g. daily stock prices, the decrease of autocorrelation in prices may lead to a decrease in trading profit. In this paper, we propose a RRL trading system which utilizes the price information, jointly with the indicators from technical analysis, fundamental analysis and econometric analysis, to produce long/short signals for daily trading. In the proposed trading system, we use a genetic algorithm as a pre-screening tool to search suitable indicators for RRL trading. Moreover, we modify the original RRL parameter update scheme in the literature for out-of-sample trading. Empirical studies are conducted based on data sets of 238 S&P stocks. It is found that the trading performance concerning the out-of-sample daily Sharpe ratios turns better: the number of companies with a positive and significant Sharpe ratio increases after feeding the selected indicators jointly with prices information into the RRL system.",
    "Affiliations": "WWZ, University of Basel, Peter Merian-Weg 6, 4002 Basel, Switzerland",
    "Author Keywords": "Econometric analysis; Fundamental analysis; Genetic algorithm; Recurrent reinforcement learning; Technical analysis",
    "Author(s) ID": "55827833100;6505926910;",
    "Authors": "Zhang J., Maringer D.",
    "Cited by": 7,
    "DOI": "10.1145/2464576.2480773",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84882295593",
    "Index Keywords": "Econometric analysis; Fundamental analysis; High-frequency trading; Indicator selections; Lower frequencies; Machine learning techniques; Recurrent reinforcement learning; Technical analysis; Costs; Genetic algorithms; Reinforcement learning; Commerce",
    "Issue": null,
    "Page end": 1758.0,
    "Page start": 1757.0,
    "Source title": "GECCO 2013 - Proceedings of the 2013 Genetic and Evolutionary Computation Conference Companion",
    "Title": "Indicator selection for daily equity trading with recurrent reinforcement learning",
    "Volume": null,
    "Year": 2013
  },
  "113": {
    "Abstract": "We develop market timing strategies and trading systems to test the intra-day predictive power of Japanese candlesticks at the 5-minute interval on the 30 constituents of the DJIA index. Around a third of the candlestick rules outperform the buy-and-hold strategy at the conservative Bonferroni level. After adjusting for trading costs, however, just a few rules remain profitable. When we correct for data snooping by applying the SSPA test on double-or-out market timing strategies, no single candlestick rule beats the buy-and-hold strategy after transaction costs. We also design fully automated trading systems by combining the best-performing candlestick rules. No evidence of out-performance is found after transaction costs. Although Japanese candlesticks can somewhat predict intra-day returns on large US caps, we show that such predictive power is too limited for active portfolio management to outperform the buy-and-hold strategy when luck, risk, and trading costs are correctly measured. © 2013 Copyright Taylor and Francis Group, LLC.",
    "Affiliations": "TCTS Laboratory, Faculté Polytechnique de Mons (FPMs), UMons, 20 Place du Parc, 7000 Mons, Belgium; Louvain School of Management, Université Catholique de Louvain, 151 Chaussée de Binche, 7000 Mons, Belgium; Louvain School of Management and CORE, Université Catholique de Louvain, 151 Chaussée de Binche, 7000 Mons, Belgium",
    "Author Keywords": "Empirical time series analysis; Technical trading; Trading strategies; Trading systems",
    "Author(s) ID": "36241432300;55681494500;16319982000;",
    "Authors": "Duvinage M., Mazza P., Petitjean M.",
    "Cited by": 7,
    "DOI": "10.1080/14697688.2013.768774",
    "Document Type": "Article",
    "EID": "2-s2.0-84880036917",
    "Index Keywords": null,
    "Issue": "7",
    "Page end": 1070.0,
    "Page start": 1059.0,
    "Source title": "Quantitative Finance",
    "Title": "The intra-day performance of market timing strategies and trading systems based on Japanese candlesticks",
    "Volume": "13",
    "Year": 2013
  },
  "12": {
    "Abstract": "In 2016, more than the 80% of transactions in the Forex market (where the world’s currencies trade) have been directed by robots. The design of profitable automatic trading systems is becoming a challenging process. This requires a strong synergy of economists and computer scientists. Our aim is to provide an optimization framework for trading systems that starting from a generic strategy, enhances its performances by exploiting mathematical constraints. Moreover, the growth of new markets requires suitable solutions integrating computer science tools with economic analysis. In this work, we mainly refer to an emerging market known as Binary Options. Starting from basic strategies used every day in the stock markets by professional traders, we show how optimization issues enhance the outcoming performances. Tests on the optimized algorithms are conducted on both historical and real time data. © Springer Nature Switzerland AG 2019.",
    "Affiliations": "Department of Mathematics and Computer Science, University of Perugia, Perugia, Italy",
    "Author Keywords": "Algorithmic optimization; Binary Options; Trading system",
    "Author(s) ID": "57204500042;35586765300;",
    "Authors": "Bigiotti A., Navarra A.",
    "Cited by": 0,
    "DOI": "10.1007/978-3-030-02351-5_30",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85055830018",
    "Index Keywords": "Commerce; Economic analysis; Algorithmic optimization; Automated trading systems; Binary Options; Computer scientists; Generic strategies; Optimization framework; Optimized algorithms; Trading systems; Electronic trading",
    "Issue": null,
    "Page end": 261.0,
    "Page start": 254.0,
    "Source title": "Advances in Intelligent Systems and Computing",
    "Title": "Optimizing automated trading systems",
    "Volume": "850",
    "Year": 2019
  },
  "120": {
    "Abstract": "Trend following (TF) is trading philosophy by which buying/selling decisions are made solely according to the observed market trend. For many years, many manifestations of TF such as a software program called Turtle Trader, for example, emerged in the industry. Surprisingly little has been studied in academic research about its algorithms and applications. Unlike financial forecasting, TF does not predict any market movement; instead it identifies a trend at early time of the day, and trades automatically afterwards by a pre-defined strategy regardless of the moving market directions during run time. Trend following trading has been popular among speculators. However it remains as a trading method where human judgment is applied in setting the rules (aka the strategy) manually. Subsequently the TF strategy is executed in pure objective operational manner. Finding the correct strategy at the beginning is crucial in TF. This usually involves human intervention in first identifying a trend, and configuring when to place an order and close it out, when certain conditions are met. In this paper, we evaluated and compared a collection of TF algorithms that can be programmed in a computer system for automated trading. In particular, a new version of TF called trend recalling model is presented. It works by partially matching the current market trend with one of the proven successful patterns from the past. Our experiments based on real stock market data show that this method has an edge over the other trend following methods in profitability. The results show that TF however is still limited by market fluctuation (volatility), and the ability to identify trend signal. © 2012 Elsevier Ltd. All rights reserved.",
    "Affiliations": "Department of Computer and Information Science, University of Macau, Macau",
    "Author Keywords": "Automated trading system; Futures contracts; Mechanical trading; Trend following",
    "Author(s) ID": "7102256353;11640258200;35321231400;",
    "Authors": "Fong S., Si Y.-W., Tai J.",
    "Cited by": 12,
    "DOI": "10.1016/j.eswa.2012.03.048",
    "Document Type": "Article",
    "EID": "2-s2.0-84861341466",
    "Index Keywords": "Academic research; Automated trading; Correct strategy; Financial forecasting; Futures contract; Human intervention; Human judgments; Market fluctuations; Market trends; Mechanical trading; Runtimes; Software program; Stock market; Trend following; Algorithms; Automation; Profitability; Commerce",
    "Issue": "13",
    "Page end": 11390.0,
    "Page start": 11378.0,
    "Source title": "Expert Systems with Applications",
    "Title": "Trend following algorithms in automated derivatives market trading",
    "Volume": "39",
    "Year": 2012
  },
  "121": {
    "Abstract": "We employ virtual generalized random access memory weightless neural networks, VG-RAM WNN, for predicting future stock returns. We evaluated our VG-RAM WNN stock predictor architecture in predicting future weekly returns of the Brazilian stock market and obtained the same error levels and properties of baseline autoregressive neural network predictors; however, our VG-RAM WNN predictor runs 5000 times faster than autoregressive neural network predictors. This allowed us to employ VG-RAM WNN predictors to build a high frequency trading system able to achieve a monthly return of approximately 35% in the Brazilian stock market. Copyright © 2011 John Wiley & Sons, Ltd.",
    "Affiliations": "Departamento de Informática, Universidade Federal Do Espírito Santo, Vitõria, Espirito Santo, Brazil; Receita Federal Do Brasil, Vitõria, Espirito Santo, Brazil",
    "Author Keywords": "high-frequency trading; high-performance time-series prediction; weightless neural networks",
    "Author(s) ID": "55425796800;26323590700;55221591500;",
    "Authors": "De Souza A.F., Freitas F.D., Coelho De Almeida A.G.",
    "Cited by": 5,
    "DOI": "10.1002/cpe.1772",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84861185207",
    "Index Keywords": "Autoregressive neural networks; Error levels; Fast learning; High frequency; High frequency HF; Random access memories; Stock market; Stock returns; Time series prediction; Trading systems; Weightless neural networks; Commerce; Forecasting; Investments; Neural networks; Random access storage",
    "Issue": "8",
    "Page end": 933.0,
    "Page start": 921.0,
    "Source title": "Concurrency Computation Practice and Experience",
    "Title": "Fast learning and predicting of stock returns with virtual generalized random access memory weightless neural networks",
    "Volume": "24",
    "Year": 2012
  },
  "122": {
    "Abstract": "Research and development of automatic trading systems are becoming more frequent, as they can reach a high potential for predicting market movements. The use of these systems allows to manage a huge amount of data related to the factors that affect investment performance (macroeconomic variables, company information, industry indicators, market variables, etc.), while avoiding psychological reactions of traders when investing in financial markets.Movements in stock markets are continuous throughout each day, which requires trading systems must be supported by more powerful engines, since the amount of data to process grows, while the response time required to support operations is shortened. In this chapter we present two parallel implementations of a GA based trading system. The first uses a Grid Volunteer System based on BOINC and the second one takes advantage of a Graphic Processing Unit implementation. © 2012 Springer Berlin Heidelberg.",
    "Affiliations": "Complutense University, Madrid, Spain; IE Business School, Spain",
    "Author Keywords": null,
    "Author(s) ID": "57196804348;7101787656;15758219800;56173710500;",
    "Authors": "Contreras I., Hidalgo J.I., Nuñez-Letamendía L., Jiang Y.",
    "Cited by": 0,
    "DOI": "10.1007/978-3-642-28789-3-9",
    "Document Type": "Article",
    "EID": "2-s2.0-84861727529",
    "Index Keywords": null,
    "Issue": null,
    "Page end": 218.0,
    "Page start": 189.0,
    "Source title": "Studies in Computational Intelligence",
    "Title": "Parallel architectures for improving the performance of a GA based trading system",
    "Volume": "415",
    "Year": 2012
  },
  "123": {
    "Abstract": "In this article we present a new method for the analysis of dependencies in case of multivariate time series. In this approach, we assume that the set of time series representing the various financial instruments creates a multidimensional variable. Such a multidimensional variable is decomposed into independent components which enable to analyze the morphology of given financial instruments and to identify the hidden interdependencies. We propose a new multiplicative version of the Natural Gradient ICA algorithm that could be used in automated trading systems or modeling environments. The presented method is tested on real stock markets data. © 2012 Springer-Verlag Berlin Heidelberg.",
    "Affiliations": "Polska Telefonia Cyfrowa Ltd., Al. Jerozolimskie 181, 02-222 Warsaw, Poland; Warsaw School of Economics, Al. Niepodleglosci 162, 02-554 Warsaw, Poland; Warsaw University of Life Sciences, ul. Nowoursynowska 159, 02-787 Warsaw, Poland",
    "Author Keywords": "financial time series decomposition; independent components analysis; information representation",
    "Author(s) ID": "6507887551;6506021257;6505769681;",
    "Authors": "Szupiluk R., Wojewnik P., Zabkowski T.",
    "Cited by": 1,
    "DOI": "10.1007/978-3-642-29350-4-72",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84861079879",
    "Index Keywords": "Automated trading; Financial market; Financial time series; ICA algorithms; Independent components; Information representation; Interaction analysis; Modeling environments; Multiplicative version; Multivariate time series; Natural gradient; Stock market; Algorithms; Artificial intelligence; Finance; Financial data processing; Soft computing; Time series; Independent component analysis",
    "Issue": "PART 2",
    "Page end": 615.0,
    "Page start": 608.0,
    "Source title": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
    "Title": "Multiplicative ICA algorithm for interaction analysis in financial markets",
    "Volume": "7268 LNAI",
    "Year": 2012
  },
  "128": {
    "Abstract": "Financial markets are highly complex adaptive systems. This paper deals with the application of simulators in software architectures for back-testing and automating financial market trading strategies. It characterizes traits and problems of algorithmic trading and describes the established use of simulators in back-testing and automated trading. A new approach in the form of a hierarchical software architecture is introduced, containing simulators as integral parts in all layers, using them both during back-testing and automated trading. In addition to the software architecture the opening objects of investigation are outlined. Finally, the potential of generalizing the application domains of our approach beyond financial market trading strategies is pointed out. © ECMS.",
    "Affiliations": "Department of Informatics, University of Hamburg, Vogt-Kölln-Str. 30, 22527 Hamburg, Germany",
    "Author Keywords": "Automated trading systems; Back-testing; Financial markets; Simulation; Software architecture",
    "Author(s) ID": "55053386000;56765369500;",
    "Authors": "Koors A., Page B.",
    "Cited by": 2,
    "DOI": null,
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84857777959",
    "Index Keywords": "Algorithmic trading; Application domains; Automated trading; Back-testing; Complex adaptive systems; Financial market; Hierarchical simulation; Integral part; Simulation; Trading strategies; Adaptive systems; Automation; Commerce; Finance; Simulators; Software architecture",
    "Issue": null,
    "Page end": 282.0,
    "Page start": 275.0,
    "Source title": "Proceedings - 25th European Conference on Modelling and Simulation, ECMS 2011",
    "Title": "A hierarchical simulation based software architecture for back-testing and automated trading",
    "Volume": null,
    "Year": 2011
  },
  "13": {
    "Abstract": "Stock market prediction and trading has attracted the effort of many researchers in several scientific areas because it is a challenging task due to the high complexity of the market. More investors put their effort to the development of a systematic approach, i.e., the so called \"Trading System (TS)\" for stocks pricing and trend prediction. The introduction of the Trading On-Line (TOL) has significantly improved the overall number of daily transactions on the stock market with the consequent increasing of the market complexity and liquidity. One of the most main consequence of the TOL is the \"automatic trading\", i.e., an ad-hoc algorithmic robot able to automatically analyze a lot of financial data with target to open/close several trading operations in such reduced time for increasing the profitability of the trading system. When the number of such automatic operations increase significantly, the trading approach is known as High Frequency Trading (HFT). In this context, recently, the usage of machine learning has improved the robustness of the trading systems including HFT sector. The authors propose an innovative approach based on usage of ad-hoc machine learning approach, starting from historical data analysis, is able to perform careful stock price prediction. The stock price prediction accuracy is further improved by using adaptive correction based on the hypothesis that stock price formation is regulated by Markov stochastic propriety. The validation results applied to such shares and financial instruments confirms the robustness and effectiveness of the proposed automatic trading algorithm. © 2019 by the authors.",
    "Affiliations": "STMicroelectronics ADG-Central R and D, Catania, 95121, Italy; IPLAB-Department of Mathematics and Computer Science, University of Catania, Catania, 95121, Italy; GIURIMATICA Lab, Department of Applied Mathematics and LawTech, Ragusa, 97100, Italy",
    "Author Keywords": "LSTM; Machine learning; Stock price",
    "Author(s) ID": "55336120800;57208901701;57208898208;6603989025;",
    "Authors": "Rundo F., Trenta F., Di Stallo A.L., Battiato S.",
    "Cited by": 7,
    "DOI": "10.3390/computation7010004",
    "Document Type": "Article",
    "EID": "2-s2.0-85066070683",
    "Index Keywords": null,
    "Issue": "1",
    "Page end": null,
    "Page start": null,
    "Source title": "Computation",
    "Title": "Advanced Markov-based machine learning framework for making adaptive trading system",
    "Volume": "7",
    "Year": 2019
  },
  "132": {
    "Abstract": "Efficiency of FOREX automatic trading system via technical indicator depends on suitability of its parameters. Using parameter forecasting with fuzzy time series is a simple and efficient solution. But its effectiveness depends on the similarities of the time series pattern to learn and to forecast which represent in the form of fuzzy relationship. This paper presents a method for time-varying fuzzy relationship. The forgetting factor allows the system to perform better in all time periods. Effects of the length of time series on forecasting the performance of the system, as well as those of profits derived from various methods on predicting the trading decisions in real markets are studied. © 2011 IEEE.",
    "Affiliations": "Faculty of Engineering, King Mongkut's Institute of Technology Ladkrabang, Bangkok, Thailand",
    "Author Keywords": "Foreign exchange forecasting; Foreign exchange trading; Forgetting factor; Fuzzy time series",
    "Author(s) ID": "8637117500;6603283634;55899212500;",
    "Authors": "Maneesilp K., Kruatrachue B., Sooraksa P.",
    "Cited by": 1,
    "DOI": "10.1109/ICMLC.2011.6016678",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-80155143320",
    "Index Keywords": "Adaptive parameters; Foreign exchange forecasting; Foreign Exchange trading; Forgetting factors; Fuzzy relationship; Fuzzy time series; Real markets; Technical indicator; Time series patterns; Time varying; Time-periods; Trading systems; Commerce; Cybernetics; Learning systems; Profitability; Time series; Forecasting",
    "Issue": null,
    "Page end": 194.0,
    "Page start": 189.0,
    "Source title": "Proceedings - International Conference on Machine Learning and Cybernetics",
    "Title": "Adaptive parameter forecasting for FOREX automatic trading system using fuzzy time series",
    "Volume": "1",
    "Year": 2011
  },
  "134": {
    "Abstract": "A number of researchers have attempted to take successful GP trading systems and make them even better through the use of filters. We investigate the use of a linear genetic programming (LGP) system that combines GP signals provided over multiple intraday time frames to produce one trading action. Four combinations of time frames stretching further into the past are examined. Two different decision mechanisms for evaluating the overall signal given the GP signals over all time frames are also examined, one based on majority vote and another based on temporal proximity to the buying decision. Results indicated that majority vote outperformed emphasis on proximity of time frames to the current trading decision. Analyses also indicated that longer time frame combinations were more conservative and outperformed shorter combinations for both overall upward and downward price trends. Copyright 2011 ACM.",
    "Affiliations": "Afinin Labs Inc., St. John's, Canada",
    "Author Keywords": "Algorithmic trading; Computational finance; Linear genetic programming",
    "Author(s) ID": "8727566700;55202038300;7005214847;",
    "Authors": "Wilson G., Leblanc D., Banzhaf W.",
    "Cited by": 3,
    "DOI": "10.1145/2001576.2001801",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84860420466",
    "Index Keywords": "Algorithmic trading; Buying decisions; Computational finance; Decision mechanism; Linear genetic programming; Longer time frames; Majority vote; Price trends; Stock trading; Time frame; Trading systems; Commerce; Genetic algorithms; Genetic programming",
    "Issue": null,
    "Page end": 1674.0,
    "Page start": 1667.0,
    "Source title": "Genetic and Evolutionary Computation Conference, GECCO'11",
    "Title": "Stock trading using linear genetic programming with multiple time frames",
    "Volume": null,
    "Year": 2011
  },
  "135": {
    "Abstract": "Automated trading systems for financial markets can use data mining techniques for future price movement prediction. However, classifier accuracy is only one important component in such a system: the other is a decision procedure utilizing the prediction in order to be long, short or out of the market. In this paper, we investigate the use of technical indicators as a means of deciding when to trade in the direction of a classifier's prediction. We compare this \"hybrid\" technical/data stream mining-based system with a naive system that always trades in the direction of predicted price movement. We are able to show via evaluations across five financial market datasets that our novel hybrid technique frequently outperforms the naive system. To strengthen our conclusions, we also include in our evaluation several \"simple\" trading strategies without any data mining component that provide a much stronger baseline for comparison than traditional buy-and-hold or sell-and-hold strategies. © 2011 Springer-Verlag Berlin Heidelberg.",
    "Affiliations": "Department of Computer Science, University of Waikato, Hamilton, New Zealand",
    "Author Keywords": null,
    "Author(s) ID": "8679147300;",
    "Authors": "Mayo M.",
    "Cited by": 0,
    "DOI": "10.1007/978-3-642-22589-5_9",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-79961161881",
    "Index Keywords": "Automated trading; Data mining techniques; Data sets; Data stream mining; Decision procedure; Financial market; Hybrid techniques; Price movement; Technical indicator; Trading strategies; Automated trading systems; Data stream mining; Decision procedure; Hybrid techniques; Price movement; Stream mining; Technical indicator; Trading strategies; Artificial intelligence; Data mining; Finance; Forecasting; Artificial intelligence; Commerce; Finance; Financial markets; Forecasting; Motion estimation; Commerce; Data mining",
    "Issue": null,
    "Page end": 90.0,
    "Page start": 79.0,
    "Source title": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
    "Title": "Hybridizing data stream mining and technical indicators in automated trading systems",
    "Volume": "6820 LNAI",
    "Year": 2011
  },
  "138": {
    "Abstract": "This study proposes a new framework for high frequency trading using a fuzzy logic based momentum analysis system. An order placement strategy will be developed and optimised with adaptive neuro fuzzy inference in order to analyse the current \"momentum\" in the time series and to identify the current market condition which will then be used to decide the dynamic participation rate given the current traded volume. The system was applied to trading of financial stocks, and tested against the standard volume based trading system. The results show how the proposed Fuzzy Logic Momentum Analysis System outperforms the standard volume based systems that are widely used in the financial industry. © 2011 Springer Science+Business Media B.V.",
    "Affiliations": "Centre for Computational Finance and Economic Agents (CCFEA), University of Essex, Wivenhoe Park, Colchester CO4 3SQ, United Kingdom",
    "Author Keywords": "Fuzzy logic; High frequency trading; Momentum analysis; Order execution",
    "Author(s) ID": "35748889300;24401964100;",
    "Authors": "Kablan A., Ng W.L.",
    "Cited by": 1,
    "DOI": "10.1007/978-94-007-1192-1_31",
    "Document Type": "Article",
    "EID": "2-s2.0-79959750926",
    "Index Keywords": "Adaptive neuro-fuzzy inference; Analysis system; Financial industry; High frequency; Market condition; Order execution; Order splitting; Participation rate; Placement strategy; Trading systems; Commerce; Electrical engineering; Fuzzy inference; Fuzzy systems; Momentum; Time series; Fuzzy logic",
    "Issue": null,
    "Page end": 389.0,
    "Page start": 377.0,
    "Source title": "Lecture Notes in Electrical Engineering",
    "Title": "Optimising order splitting and execution with fuzzy logic momentum analysis",
    "Volume": "90 LNEE",
    "Year": 2011
  },
  "139": {
    "Abstract": "Based on the principles of technical analysis, this paper proposes an artificial intelligence model, which employs the Adaptive Network Fuzzy Inference System (ANFIS) supplemented by the use of reinforcement learning (RL) as a non-arbitrage algorithmic trading system. The novel intelligent trading system is capable of identifying a change in a primary trend for trading and investment decisions. It dynamically determines the periods for momentum and moving averages using the RL paradigm and also appropriately shifting the cycle using ANFIS-RL to address the delay in the predicted cycle. This is used as a proxy to determine the best point in time to go LONG and visa versa for SHORT. When this is coupled with a group of stocks, we derive a simple form of \"riding the cycles - waves\". These are the derived features of the underlying stock movement. It provides a learning framework to trade on cycles. Initial experimental results are encouraging. Firstly, the proposed framework is able to outperform DENFIS and RSPOP in terms of true error and correlation. Secondly, based on the test trading with five US stocks, the proposed trading system is able to beat the market by about 50 percentage points over a period of 13 years. © 2010 Elsevier Ltd. All rights reserved.",
    "Affiliations": "Centre for Computational Intelligence, School of Computer Engineering, Nanyang Technological University, Blk N4 #2A-32, Nanyang Avenue, Singapore 639798, Singapore; Australian Catholic University, Department of Business and Informatics, 7 Mount St., Sydney, Australia",
    "Author Keywords": "ANFIS; Investment decisions; Price cycles; Reinforcement learning; Stock trading",
    "Author(s) ID": "36967676100;8869387400;9276658900;",
    "Authors": "Tan Z., Quek C., Cheng P.Y.K.",
    "Cited by": 39,
    "DOI": "10.1016/j.eswa.2010.09.001",
    "Document Type": "Article",
    "EID": "2-s2.0-79151482221",
    "Index Keywords": "Adaptive network fuzzy inference systems; Algorithmic trading system; ANFIS; Investment decisions; Learning frameworks; Moving averages; Percentage points; Price cycle; Stock movement; Stock trading; Technical analysis; Time-to-go; Trading systems; True error; Artificial intelligence; Fuzzy inference; Investments; Reinforcement learning; Commerce",
    "Issue": "5",
    "Page end": 4755.0,
    "Page start": 4741.0,
    "Source title": "Expert Systems with Applications",
    "Title": "Stock trading with cycles: A financial application of ANFIS and reinforcement learning",
    "Volume": "38",
    "Year": 2011
  },
  "14": {
    "Abstract": "Nowadays, Artificial Intelligence (AI) is changing our daily life in many application fields. Automatic trading has inspired a large number of field experts and scientists in developing innovative techniques and deploying cutting-edge technologies to trade different markets. In this context, cryptocurrency has given new interest in the application of AI techniques for predicting the future price of a financial asset. In this work Deep Reinforcement Learning is applied to trade bitcoin. More precisely, Double and Dueling Double Deep Q-learning Networks are compared over a period of almost four years. Two reward functions are also tested: Sharpe ratio and profit reward functions. The Double Deep Q-learning trading system based on Sharpe ratio reward function demonstrated to be the most profitable approach for trading bitcoin. © 2019, IFIP International Federation for Information Processing.",
    "Affiliations": "Università degli Studi di Milano-Bicocca, Milan, Italy; Istituto di Matematica Applicata e Tecnologie Informatiche, IMATI-CNR, Milan, Italy",
    "Author Keywords": "Automatic trading; Cryptocurrency; Deep Reinforcement Learning; Double Deep Q-learning Networks; Dueling architecture",
    "Author(s) ID": "57208838978;35730783800;",
    "Authors": "Lucarelli G., Borrotti M.",
    "Cited by": 0,
    "DOI": "10.1007/978-3-030-19823-7_20",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85065912982",
    "Index Keywords": "Bitcoin; Electronic money; Machine learning; Profitability; Reinforcement learning; Application fields; Automatic trading; Cutting edge technology; Financial assets; Innovative techniques; Q-learning; Reinforcement learning approach; Trading systems; Deep learning",
    "Issue": null,
    "Page end": 258.0,
    "Page start": 247.0,
    "Source title": "IFIP Advances in Information and Communication Technology",
    "Title": "A Deep Reinforcement Learning Approach for Automated Cryptocurrency Trading",
    "Volume": "559",
    "Year": 2019
  },
  "140": {
    "Abstract": "Financial volatility refers to the intensity of the fluctuations in the expected return on an investment or the pricing of a financial asset due to market uncertainties. Hence, volatility modeling and forecasting is imperative to financial market investors, as such projections allow the investors to adjust their trading strategies in anticipation of the impending financial market movements. Following this, financial volatility trading is the capitalization of the uncertainties of the financial markets to realize investment profits in times of rising, falling and side-way market conditions. In this paper, an intelligent straddle trading system (framework) that consists of a volatility projection module (VPM) and a trade decision module (TDM) is proposed for financial volatility trading via the buying and selling of option straddles to help a human trader capitalizes on the underlying uncertainties of the Hong Kong stock market. Three different measures, namely: (1) the historical volatility (HV), (2) implied volatility (IV) and (3) model-based volatility (MV) of the Hang Seng Index (HSI) are employed to quantify the implicit volatility of the Hong Kong stock market. The TDM of the proposed straddle trading system combines the respective volatility measures with the well-established moving-averages convergence/divergence (MACD) principle to recommend trading actions to a human trader dealing in HSI straddles. However, the inherent limitation of the MACD trading rule is that it generates time-delayed trading signals due to the use of moving averages, which are essentially lagging trend indicators. This drawback is intuitively addressed in the proposed straddle trading system by applying the VPM to compute future projections of the volatility measures of the HSI prior to the activation of the TDM. The VPM is realized by a self-organising neural-fuzzy semantic network named the evolving fuzzy semantic memory (eFSM) model. As compared to existing statistical and computational intelligence based modeling techniques currently employed for financial volatility modeling and forecasting, eFSM possesses several desirable attributes such as: (1) an evolvable knowledge base to continuously address the non-stationary characteristics of the Hong Kong stock market; (2) highly formalized human-like information computations; and (3) a transparent structure that can be interpreted via a set of linguistic IF-THEN semantic fuzzy rules. These qualities provide added credence to the computed HSI volatility projections. The volatility modeling and forecasting performances of the eFSM, when benchmarked to several established modeling techniques, as well as the observed trading returns of the proposed straddle trading system, are encouraging. © 2010 Elsevier Ltd. All rights reserved.",
    "Affiliations": "Centre for Computational Intelligence, School of Computer Engineering, Nanyang Technological University, Nanyang Avenue, Singapore 639798, Singapore",
    "Author Keywords": "Automated trading system; Evolving neural-fuzzy semantic model; Financial volatility; Hang Seng Index (HSI) options; Moving-averages convergence/divergence (MACD) trading rule; Straddle trading",
    "Author(s) ID": "7005685778;8869387400;",
    "Authors": "Tung W.L., Quek C.",
    "Cited by": 27,
    "DOI": "10.1016/j.eswa.2010.07.116",
    "Document Type": "Article",
    "EID": "2-s2.0-79151470984",
    "Index Keywords": "Automated trading; Evolving neural-fuzzy semantic model; Financial volatility; Hang Seng Index (HSI) options; Straddle trading; Trading rules; Economics; Forecasting; Investments; Knowledge based systems; Neural networks; Profitability; Commerce",
    "Issue": "5",
    "Page end": 4688.0,
    "Page start": 4668.0,
    "Source title": "Expert Systems with Applications",
    "Title": "Financial volatility trading using a self-organising neural-fuzzy semantic network and option straddle-based approach",
    "Volume": "38",
    "Year": 2011
  },
  "143": {
    "Abstract": "Traders make trade decisions specifying entry, exit, and stop loss prices. Technicians often decide on entry, exit, and stop loss prices based on a predefined set of technical rules. In this paper, we employ a method based on grammatical evolution to coevolve technical rules for entry, exit, and stop loss for trading a London Stock Exchange (LSE) based stock in high frequency. We consider the case of two class of investors with risk averse, and loss preferences and build a partial trading frontier given the preferences considered. The performance of the rules evolved is compared to a publicly available trading system called the turtle trading system (TTS) and the best rules produced by our method outperforms TTS.",
    "Affiliations": "Center for Computational Finance and Economic Agents, University of Essex, C04 3SQ, United Kingdom",
    "Author Keywords": "Coevolution; Grammatical evolution; High frequency trading; Trading systems; Turtle trading system",
    "Author(s) ID": "26324822500;57205870267;",
    "Authors": "Adamu K., Phelps S.",
    "Cited by": 5,
    "DOI": null,
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-79959723180",
    "Index Keywords": "Co-evolution; Grammatical evolution; High frequency; London Stock Exchange; Loss price; Risk averse; Technical rules; Technical trading rules; Trading systems; Computational grammars; Commerce",
    "Issue": null,
    "Page end": 101.0,
    "Page start": 96.0,
    "Source title": "WCE 2010 - World Congress on Engineering 2010",
    "Title": "Coevolution of technical trading rules for high frequency trading",
    "Volume": "1",
    "Year": 2010
  },
  "144": {
    "Abstract": "In this paper we use a nonlinear processing technique based on mathematical morphology to develop a simple day trading system that automatically decides the timing to commute the marked strategy in terms of sort/long positions. In this short paper we show preliminary results. © 2010 Springer-Verlag Berlin Heidelberg.",
    "Affiliations": "Grup de Tecnologies Digitals, University of Vic, C/de la Laura, 13, VIC 08500, Spain; BISITE, Plaza de la Merced s/n, Salamanca 37008, Spain",
    "Author Keywords": "Algorithmic trading; Mathematical Morphology; Nonlinear Processing",
    "Author(s) ID": "15022594500;24778714800;8899577600;23390245600;",
    "Authors": "Marti-Puig P., Reig-Bolaño R., Bajo J., Rodriguez S.",
    "Cited by": 0,
    "DOI": "10.1007/978-3-642-14883-5_56",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-80052981829",
    "Index Keywords": "Algorithmic trading; Morphological filtering; Nonlinear processing; Trading systems; Artificial intelligence; Commerce; Distributed computer systems; Morphology; Mathematical morphology",
    "Issue": null,
    "Page end": 439.0,
    "Page start": 435.0,
    "Source title": "Advances in Intelligent and Soft Computing",
    "Title": "Market stock decisions based on morphological filtering",
    "Volume": "79",
    "Year": 2010
  },
  "145": {
    "Abstract": "Options are highly non-linear and complicated products in financial markets. Owing to the high risk associated with option trading, investment on options is a knowledge-intensive industry. This study develops a novel decision support system for option trading. In the first stage, independent component analysis (ICA) is employed to uncover the independent hidden forces of the stock market that drive the price movement of an option. In the second stage, a dynamic kernel predictors are constructed for trading decisions. Comparing with convectional feature extractions and pure regression models, the performance improvement of the new method is significant and robust. The cumulated trading profits are substantialy increased. The resultant intelligent investment decision support system can help investors, fund managers and investment decision-makers make profitable decisions. © Springer-Verlag Berlin Heidelberg 2010.",
    "Affiliations": "Department of Business Administration, National Changhua University of Education, Taiwan; Graduate Institute of Finance, National Taipei College of Business, Taiwan; Institute of International Economics, National Dong Hwa University, Taiwan",
    "Author Keywords": "Algorithmic trading system; Financial trading; Independent component analysis; Kernel partial least square regression; Support vector machine",
    "Author(s) ID": "15044616100;55772071600;16031108300;37080084800;",
    "Authors": "Huang S.-C., Li C.-C., Lee C.-W., Chang M.J.",
    "Cited by": 4,
    "DOI": "10.1007/978-3-642-14616-9_15",
    "Document Type": "Article",
    "EID": "2-s2.0-84879320585",
    "Index Keywords": "Algorithmic trading system; Complicated products; Financial trading; Independent component analysis(ICA); Kernel based regression; Kernel partial least square regressions; Knowledge-intensive industries; Performance improvements; Artificial intelligence; Decision support systems; Independent component analysis; Investments; Profitability; Regression analysis; Support vector machines; Commerce",
    "Issue": null,
    "Page end": 169.0,
    "Page start": 163.0,
    "Source title": "Smart Innovation, Systems and Technologies",
    "Title": "Combining ICA with Kernel based regressions for trading support systems on financial options",
    "Volume": "4",
    "Year": 2010
  },
  "149": {
    "Abstract": "The principle objective of this paper is to obtain trading rules with a low risk level which are also capable of obtaining high returns. To that purpose a methodology has been defined, based on the design of a genetic algorithm GAP and an incremental training technique adapted to the learning of series of stock market values. The GAP technique consists in a fusion of GP and GA. In GAP a chromosome is composed of a tree with language operators and a vector with numeric values. The GAP algorithm implements the automatic search for trading rules taking as objectives of the training both the optimization of the return obtained and the minimization of the assumed risk. In order to diminish high over-fitting, a technique of incremental training has been used. Applying the proposed methodology, rules have been obtained for a period of eight years of the S&P500 index. The achieved adjustment of the relation return-risk has generated rules with returns very superior in the testing period to those obtained applying habitual methodologies and even clearly superior to Buy&Hold. Insert your abstract here. Include keywords, PACS and mathematical subject classification numbers as needed. © 2008 Springer Science+Business Media, LLC.",
    "Affiliations": "Computer Science Department, University of Oviedo, Campus de Viesques, Gijón 33203, Spain; Cuantitative Economy Department, University of Oviedo, Campus Del Cristo, Oviedo 33002, Spain",
    "Author Keywords": "Automatic trading systems; GAPs; Soft computing; Technical analisys",
    "Author(s) ID": "25626328500;23472563700;36133411000;",
    "Authors": "Fernandez Garcia M.E., De La Cal Marin E.A., Quiroga Garcia R.",
    "Cited by": 7,
    "DOI": "10.1007/s10489-008-0151-x",
    "Document Type": "Article",
    "EID": "2-s2.0-77956714627",
    "Index Keywords": "Automatic searches; GAPs; Incremental training; Numeric values; Overfitting; Risk levels; Stock market; Subject classification; Technical analisys; Technical trading rules; Trading rules; Trading systems; Genetic algorithms; Mathematical operators; Optimization; Risk perception; Soft computing; Commerce",
    "Issue": "2",
    "Page end": 106.0,
    "Page start": 93.0,
    "Source title": "Applied Intelligence",
    "Title": "Improving return using risk-return adjustment and incremental training in technical trading rules with GAPs",
    "Volume": "33",
    "Year": 2010
  },
  "15": {
    "Abstract": "Profitability of a trading system based on the momentum-like effects of asset price jumps was tested on four currency markets (EUR/USD, GBP/USD, USD/CHF and USD/JPY) and three futures markets (Light Crude Oil, E-Mini S&P 500 and VIX), on 7 frequencies (1-minute to 1-day), over a period of more than 20 years. The proposed trading system entered long and short trades in the direction of asset price jumps and held the positions for a fixed horizon, optimized on the in-sample period. The system achieved statistically significant out-sample profits for the USD/CHF, EUR/USD and GBP/USD exchange rates, especially on the 15-minute, 30-minute and 1-hour frequencies, with expected returns of up to 20–30% p.a., including transaction costs. On the 1-day frequency, on the USD/JPY and on the three analysed futures markets, only insignificant profits or losses were achieved. On the 1-minute frequency, the system ended with a loss for all of the assets. © 2019, University of Economics - Prague. All rights reserved.",
    "Affiliations": "Faculty of Finance and Accounting, University of Economics, Prague, Czech Republic",
    "Author Keywords": "Asset price jumps; High-frequency trading; L-estimator; Momentum trading",
    "Author(s) ID": "57190757881;",
    "Authors": "Fičura M.",
    "Cited by": 0,
    "DOI": "10.18267/j.pep.703",
    "Document Type": "Article",
    "EID": "2-s2.0-85073373267",
    "Index Keywords": null,
    "Issue": "4",
    "Page end": 401.0,
    "Page start": 385.0,
    "Source title": "Prague Economic Papers",
    "Title": "Profitability of trading in the direction of asset price jumps – Analysis of multiple assets and frequencies",
    "Volume": "28",
    "Year": 2019
  },
  "151": {
    "Abstract": "Automated trading is a novel field of study in which computer programs are put in charge of deciding when and how to trade financial instruments. Intelligent agents, with their ability to act autonomously and to adapt and interact with the environment, seem like an obvious choice for the development of automated trading systems. The aim of this article is to analyze how well intelligent agents suit this task. We implemented a set of autonomous currency trading agents, using an architecture that consists of an ensemble of classification and regression models, a case-based reasoning system and an expert system. A total of six trading agents were implemented, each being responsible for trading one of the following currency pair in the Forex market: EUR/USD, EUR/JPY, EUR/CHF, USD/JPY, USD/CHF and CHF/JPY. The agents simulated trades over a period of 23 months, having all achieved a reasonable profit trading independently. However, their strategies resulted in relatively high drawdows. In order to decrease the risk inherent to these high drawdowns, the same simulation was performed while making the agents share the monetary resources. As expected, this strategy of investment diversification originated better results. Still, when the trading costs were taken into consideration, the overall trading performance was less than impressive. That was due to the fact that each agent performed too many trades, and the cost associated with the trading commissions became prohibitively high. We were able to lessen the impact of the trading costs in the total profit by integrating the agents in a multi-agent system, in which the agents communicated with each other before opening new trades. This allowed them to calculate the intended exposure to the market, which in turn enabled them to avoid redundant trades. Under simulation and using low leverage, this multi-agent system obtained a 55.7% profit in 23 months of trading, with a 9.0% maximum drawdown. © 2010 Springer-Verlag Berlin Heidelberg.",
    "Affiliations": "Department of Informatics, University of Minho, Portugal",
    "Author Keywords": null,
    "Author(s) ID": "14046673500;6603451488;",
    "Authors": "Barbosa R.P., Belo O.",
    "Cited by": 15,
    "DOI": "10.1007/978-3-642-13526-2_5",
    "Document Type": "Article",
    "EID": "2-s2.0-77956313183",
    "Index Keywords": null,
    "Issue": null,
    "Page end": 118.0,
    "Page start": 91.0,
    "Source title": "Studies in Computational Intelligence",
    "Title": "Multi-agent forex trading system",
    "Volume": "289",
    "Year": 2010
  },
  "152": {
    "Abstract": "Biological systems are inspiration for the design of optimisation and classification models. Applying various forms of bio-inspired algorithms may be a very high-complex system. Modelling of financial markets is challenging for several reasons, because many plausible factors impact on it. An automated trading on financial market is not a new phenomenon. The model of bio-inspired hybrid adaptive trading system based on technical indicators usage by grammatical evolution and moving window is presented in this paper. The proposed system is just one of possible bio-inspired system which can be used in financial forecast, corporate failure prediction or bond rating company. © 2010 Springer-Verlag.",
    "Affiliations": "University of Novi Sad, Faculty of Technical Sciences, Trg Dositeja Obradovića 6, 21000 Novi Sad, Serbia; Novi Sad Fair, Hajduk Veljkova 11, 21000 Novi Sad, Serbia; University of Novi Sad, Faculty of Medicine, Hajduk Veljkova 1, 21000 Novi Sad, Serbia",
    "Author Keywords": "Bio-inspired; financial markets; grammatical evolution",
    "Author(s) ID": "35590678200;35113052000;8208650100;",
    "Authors": "Simić D., Gajić V., Simić S.",
    "Cited by": 0,
    "DOI": "10.1007/978-3-642-13769-3_25",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-77954588073",
    "Index Keywords": "Automated trading; Bio-inspired; Bio-inspired algorithms; Bioinspired systems; Bond ratings; Classification models; Complex systems; Failure prediction; Financial market; Grammatical evolution; Hybrid model; Moving window; Optimisations; Technical indicator; Trading systems; Artificial intelligence; Biology; Commerce; Computational grammars; Finance",
    "Issue": "PART 1",
    "Page end": 212.0,
    "Page start": 205.0,
    "Source title": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
    "Title": "An approach of bio-inspired hybrid model for financial markets",
    "Volume": "6076 LNAI",
    "Year": 2010
  },
  "153": {
    "Abstract": "This paper presents the threshold recurrent reinforcement learning (TRRL) model and describes its application in a simple automated trading system. The TRRL is a regime-switching extension of the recurrent reinforcement learning (RRL) algorithm. The basic RRL model was proposed by Moody and Wu (1997) and used for uncovering trading strategies. We argue that the RRL is not sufficiently equipped to capture the non-linearities and structural breaks present in financial data, and propose the TRRL model as a more suitable algorithm for such environments. This paper gives a detailed description of the TRRL and compares its performance with that of the basic RRL model in a simple automated trading framework using daily data from four well-known European indices. We assume a frictionless setting and use volatility as an indicator variable for switching between regimes. We find that the TRRL produces better trading strategies in all the cases studied, and demonstrate that it is more apt at finding structure in non-linear financial time series than the standard RRL. © 2010 Springer-Verlag Berlin Heidelberg.",
    "Affiliations": "Universität Basel, Basel CH-4002, Switzerland",
    "Author Keywords": "Automated trading; Differential Sharpe ratio; Regime-switching; Reinforcement learning",
    "Author(s) ID": "6505926910;36053629800;",
    "Authors": "Maringer D., Ramtohul T.",
    "Cited by": 8,
    "DOI": "10.1007/978-3-642-12242-2-22",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-77952384423",
    "Index Keywords": "Automated trading; Differential Sharpe ratio; Financial data; Financial time series; Indicator variables; Non-linear; Nonlinearities; Recurrent reinforcement learning; Regime switching; Structural break; Trading strategies; Automation; Commerce; Financial data processing; Learning algorithms; Reinforcement learning; Switching; Time series; Reinforcement",
    "Issue": "PART 2",
    "Page end": 221.0,
    "Page start": 212.0,
    "Source title": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
    "Title": "Threshold recurrent reinforcement learning model for automated trading",
    "Volume": "6025 LNCS",
    "Year": 2010
  },
  "154": {
    "Abstract": "We propose a multi-stock automated trading system that relies on a layered structure consisting of a machine learning algorithm, an online learning utility, and a risk management overlay. Alternating decision tree (ADT), which is implemented with Logitboost, was chosen as the underlying algorithm. One of the strengths of our approach is that the algorithm is able to select the best combination of rules derived from well-known technical analysis indicators and is also able to select the best parameters of the technical indicators. Additionally, the online learning layer combines the output of several ADTs and suggests a short or long position. Finally, the risk management layer can validate the trading signal when it exceeds a specified non-zero threshold and limit the application of our trading strategy when it is not profitable. We test the expert weighting algorithm with data of 100 randomly selected companies of the S & P 500 index during the period 2003-2005. We find that this algorithm generates abnormal returns during the test period. Our experiments show that the boosting approach is able to improve the predictive capacity when indicators are combined and aggregated as a single predictor. Even more, the combination of indicators of different stocks demonstrated to be adequate in order to reduce the use of computational resources, and still maintain an adequate predictive capacity. © 2010 Taylor & Francis.",
    "Affiliations": "CENTRUM Católica, Pontificia Universidad Católica del Peru, Peru; Department of Computer Science and Engineering, University of California, La Jolla, CA 92093-0404, United States",
    "Author Keywords": "Algorithmic trading; Automated trading; Boosting; Machine learning",
    "Author(s) ID": "6603915895;7003517988;",
    "Authors": "Creamer G., Freund Y.",
    "Cited by": 33,
    "DOI": "10.1080/14697680903104113",
    "Document Type": "Article",
    "EID": "2-s2.0-77951262368",
    "Index Keywords": null,
    "Issue": "4",
    "Page end": 420.0,
    "Page start": 401.0,
    "Source title": "Quantitative Finance",
    "Title": "Automated trading with boosting and expert weighting",
    "Volume": "10",
    "Year": 2010
  },
  "156": {
    "Abstract": "Recent technological and regulatory advances have coalesced to usher in an era where both automated and algorithmic trading routinely characterize a wealth maximization process managed by the continuous trading of equity securities. Under this approach to wealth maximization, automated trading focuses on the process determining directional trades for individual securities based upon the receipt and interpretation of new data. This paper presents a stochastic price formation algorithm that implements a cognitive decision making system modeled by twin radial basis function artificial neural networks to produce a high frequency automated trading system for individual equity securities listed on U.S. exchanges. The overall effectiveness and efficiency of the automated trading system is calibrated by estimating non-parametric quasi elasticity coefficients for individual firm fundamental characteristics. We find that automation driven by cognitive science can effectively auto-trade securities and produce changes to individual wealth that equals or exceeds the performance generated by a simple buy-and-hold strategy. We also identify four fundamental firm factors that explain the ability of the automated trading algorithm to produce a measured level of percent-positive trades. © Izmir University of Economics, Turkey, 2010.",
    "Affiliations": "College of Business Administration, University of Rhode Island, United States; NKD Group, Inc., Computer Science and Statistics, University of Rhode Island, United States; Thomson Reuters, Boston, MA, United States",
    "Author Keywords": "Artificial neural networks; Automated trading; Cognitive science; Stochastic models",
    "Author(s) ID": "8692917000;8692916900;56069025500;",
    "Authors": "Dash Jr. G.H., Kajiji N., Forman J.",
    "Cited by": 0,
    "DOI": null,
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84905453251",
    "Index Keywords": "Algorithms; Automation; Neural networks; Optimization; Radial basis function networks; Stochastic models; Stochastic systems; Automated trading; Automated trading systems; Cognitive decision makings; Cognitive science; Elasticity coefficients; Fundamental characteristics; Multicriteria decision; Radial basis function artificial neural networks; Commerce",
    "Issue": null,
    "Page end": 293.0,
    "Page start": 288.0,
    "Source title": "24th Mini EURO Conference on Continuous Optimization and Information-Based Technologies in the Financial Sector, MEC EurOPT 2010",
    "Title": "Stochastic multi criteria decision analytics and artificial intelligence in continuous automated trading for wealth maximization",
    "Volume": null,
    "Year": 2010
  },
  "157": {
    "Abstract": "This work is focused on the automated trading systems (ATS) design and optimization. In a preparation phase before use, an optimization of interaction of such systems with its intended market environment should be done. The technical analysis indicators are most frequently used in ATS. Optimization is done by testing of different settings of MACD indicator and optimal settings depend heavily on market parameters. The intended use of the ATS is to perform its activity independently to some extend (depending on user's preferences). The main aim is to enhance automated trading system performance, in order to improve its usefulness and acceptability for the user. Paper will be focused on futures markets only (Chicago and New York), but results are applicable to other areas of trading as well. © 2010 Springer-Verlag Berlin Heidelberg.",
    "Affiliations": "Department of Information Technologies, Faculty of Informatics and Management, University of Hradec Kralove, Rokitanskeho 62, Hradec Kralove 500 03, Czech Republic",
    "Author Keywords": null,
    "Author(s) ID": "14055176600;",
    "Authors": "Tucnik P.",
    "Cited by": 23,
    "DOI": "10.1007/978-3-642-16101-8_5",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-78349302665",
    "Index Keywords": "Automation; Information science; Optimization; Automated trading; Chicago; Design and optimization; Futures market; Market environment; New York; Optimal setting; Technical analysis; Commerce",
    "Issue": null,
    "Page end": 61.0,
    "Page start": 55.0,
    "Source title": "Lecture Notes in Business Information Processing",
    "Title": "Optimization of automated trading system's interaction with market environment",
    "Volume": "64 LNBIP",
    "Year": 2010
  },
  "162": {
    "Abstract": "The prediction of financial time series is a very complicated process. An initial look at financial time series gives the impression that they are random in nature. If true, this would make the forecast, and therefore the trading, of such series exceptionally difficult. The efficient market hypothesis states that the current price contains all available information in the market. This leads to the predictability of most financial time series as being a rather controversial issue. Experts have been forecasting and trading financial markets for decades, using their knowledge and expertise in recognizing patterns and interpreting current financial data. This paper extends the Adaptive Neuro-Fuzzy Inference System to create an expert system that is capable of using fuzzy reasoning combined with the pattern recognition capability of neural networks to be used in financial forecasting and trading. The novelty of the approach lies in its application to the field of high frequency finance. Such an approach has not been used so far with high frequency trading or as a part of an automated trading strategy. This has produced an expert trading system which overcomes the physical limitations of human experts and traders in taking multiple decisions at extremely short time intervals. This means the system can perform predictions and trading decisions at a very high frequency using intra-day data. © 2009 IEEE.",
    "Affiliations": "Centre for Computational Finance and Economic Agents, University of Essex, United Kingdom",
    "Author Keywords": "Efficient market hypothesis; Financial prediction; High frequency trading; Neuro-fuzzy inference system",
    "Author(s) ID": "35748889300;",
    "Authors": "Kablan A.",
    "Cited by": 16,
    "DOI": "10.1109/ADVCOMP.2009.23",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-77949509317",
    "Index Keywords": "Adaptive neuro-fuzzy inference system; Automated trading; Efficient market hypothesis; Financial data; Financial forecasting; Financial market; Financial prediction; Financial time series; Financial trading; Fuzzy reasoning; High frequency; High-frequency finance; Human expert; Neuro-fuzzy inference systems; Physical limitations; Short time intervals; Trading systems; Very high frequency; Computer aided engineering; Expert systems; Finance; Financial data processing; Forecasting; Fuzzy inference; Fuzzy neural networks; Fuzzy systems; Pattern recognition systems; Time series; Commerce",
    "Issue": null,
    "Page end": 110.0,
    "Page start": 105.0,
    "Source title": "3rd International Conference on Advanced Engineering Computing and Applications in Sciences, ADVCOMP 2009",
    "Title": "Adaptive neuro fuzzy inference systems for high frequency financial trading and forecasting",
    "Volume": null,
    "Year": 2009
  },
  "163": {
    "Abstract": "Trading automation is a hotspot in the field of financial research. The key to an automated trading system is the buy&sell rule. Various technical indicators have been studied and developed to generate the trading signal of buy and sell. Each indicator has its advantage and disadvantage. Single indicator often produces false signal which may cause loss.In order to promote quality and reliability of trading signal,this paper present a method to fuse multiple indicators based on D-S theory. Some classical indicators including MACD,RSI,CCI and are selected to be fused. A corresponding trading strategy backtesting on Euro vs US dollar in 2008s is done to validate the effectiveness of this method compared with using single indicator. © 2009 IEEE.",
    "Affiliations": "Department of Automation, Tsinghua University, Beijing,100084, China",
    "Author Keywords": null,
    "Author(s) ID": "36068786300;7201474274;",
    "Authors": "Liu Z., Xiao D.",
    "Cited by": 10,
    "DOI": "10.1109/FSKD.2009.395",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-76349117877",
    "Index Keywords": "Automated trading; D S evidence theory; Forex markets; Hot spot; Technical indicator; Trading strategies; US dollar; Automation; Fuzzy systems; Commerce",
    "Issue": null,
    "Page end": 243.0,
    "Page start": 239.0,
    "Source title": "6th International Conference on Fuzzy Systems and Knowledge Discovery, FSKD 2009",
    "Title": "An automated trading system with multi-indicator fusion based on D-S evidence theory in forex market",
    "Volume": "3",
    "Year": 2009
  },
  "164": {
    "Abstract": "Statistical arbitrage refers to a class of algorithmic trading systems implementing data mining strategies. In this chapter we describe a computational framework for statistical arbitrage based on support vector regression. The algorithm learns the fair price of the security under management by minimining a regularized ε-insensitive loss function in an on-line fashion, using the most recent market information acquired by means of streaming financial data. The difficult issue of adaptive learning in non-stationary environments is addressed by adopting an ensemble learning approach, where a meta-algorithm strategically combines the opinion of a pool of experts. Experimental results based on nearly seven years of historical data for the iShare S&P 500 ETF demonstrate that satisfactory risk-adjusted returns can be achieved by the data mining system even after transaction costs. © 2009 Springer US.",
    "Affiliations": "Department of Mathematics, Imperial College London, 180 Queen's Gate, Caixa Postal: 15064, London SW7 2AZ, United Kingdom",
    "Author Keywords": null,
    "Author(s) ID": "23019288000;55980610900;",
    "Authors": "Montana G., Parrella F.",
    "Cited by": 2,
    "DOI": "10.1007/978-0-387-79420-4_20",
    "Document Type": "Book Chapter",
    "EID": "2-s2.0-79952453197",
    "Index Keywords": null,
    "Issue": null,
    "Page end": 295.0,
    "Page start": 283.0,
    "Source title": "Data Mining for Business Applications",
    "Title": "Data mining for algorithmic asset management",
    "Volume": null,
    "Year": 2009
  },
  "174": {
    "Abstract": "In algorithmic trading applications, a large number of coevolving financial data streams are observed and analyzed. A recurrent and important task is to determine how a given stream depends on others, over time, accounting for dynamic dependence patterns and without imposing any probabilistic law governing this dependence. We demonstrate how Flexible Least Squares (FLS), a penalized version of ordinary least squares that accommodates for dynamic regression coefficients, can be deployed successfully in this context. We describe a market-neutral algorithmic trading system based on a combined use of on-line feature extraction and recursive regression. The system has been proved to perform successfully when trading the S&P 500 Futures Index. Copyright 2008 ACM.",
    "Affiliations": "Department of Mathematics Statistics Section, Imperial College London, London SW7 2AZ, United Kingdom; Department of Probability and Statistics, University of Sheffield, Sheffield S3 7RH, United Kingdom; BlueCrest Capital Management",
    "Author Keywords": "Algorithmic trading; Flexible least squares; Incremental principal component analysis; Temporal data mining",
    "Author(s) ID": "23019288000;8554439400;23669456500;",
    "Authors": "Montana G., Triantafyllopoulos K., Tsagaris T.",
    "Cited by": 5,
    "DOI": "10.1145/1363686.1363910",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-56749103462",
    "Index Keywords": "Commerce; Curve fitting; Data mining; Feature extraction; Information management; Least squares approximations; Algorithmic trading; Data stream minings; Financial datums; Flexible least squares; Incremental principal component analysis; Ordinary Least Squares; Probabilistic laws; Regression coefficients; Temporal data mining; Trading systems; Principal component analysis",
    "Issue": null,
    "Page end": 970.0,
    "Page start": 966.0,
    "Source title": "Proceedings of the ACM Symposium on Applied Computing",
    "Title": "Data stream mining for market-neutral algorithmic trading",
    "Volume": null,
    "Year": 2008
  },
  "175": {
    "Abstract": "In practice, it is difficult to gain profit in the process of trading interest rate derivative commodities. This could be attributed to the complexity of existing pricing models, which are derived from the term structure and yield curve, both of which cannot adapt well to short-term market dynamics. In this study, we use the Extended Classifier System (XCS) to model the market behavior of interest rate futures, the purpose of which is to provide effective trading decision support. Several technical indicators and their first- and second-order derivatives are selected as the market descriptive variables, which are then used for XCS training. Finally, the adaptive rules of the classifiers, which consist of conditions with relative actions considered helpful for constructing the automatic trading system, are generated from the XCS knowledge discovery process. The market data of the 10-year government bond futures traded in Taiwan are chosen for empirical study to verify the accuracy and profitability of the XCS model. These were also used to conduct a comparative evaluation between the random walk and tendency following models and the XCS model. © 2008 IEEE.",
    "Affiliations": "Institute of Information Management, National Chiao Tung University, Taiwan; Mackay Medicine, Nursing and Management College, Taiwan",
    "Author Keywords": null,
    "Author(s) ID": "21741959100;24511909100;57212180204;37760906000;",
    "Authors": "Chen A.-P., Hsu Y.-C., Huang C.-H., Yang Y.-C.",
    "Cited by": 2,
    "DOI": "10.1109/ISDA.2008.219",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-67549088252",
    "Index Keywords": "Comparative evaluations; Decision supports; Empirical studies; Extended classifier system; Government bonds; Interest rates; Knowledge discovery process; Market behavior; Market data; Market dynamics; Pricing models; Random Walk; Second order derivatives; Technical analysis; Technical indicator; Term structure; Trading systems; Yield curve; Classifiers; Decision support systems; Derivatives; Economics; Intelligent systems; Learning systems; Systems analysis; Commerce",
    "Issue": null,
    "Page end": 603.0,
    "Page start": 598.0,
    "Source title": "Proceedings - 8th International Conference on Intelligent Systems Design and Applications, ISDA 2008",
    "Title": "Applying the extended classifier system to trade interest rate futures based on technical analysis",
    "Volume": "3",
    "Year": 2008
  },
  "176": {
    "Abstract": "A new approach to algorithmic trading system development is presented. This approach, Kernel Price Pattern Trading (KPPTP ), allows the practitioner to link the performance of a learned classifier (that predicts the occurrence of the price pattern P) to the profitability of the system. A positive definite kernel based distance that tries to capture the drivers of the process of price patterns formation and some results about the profitability of the system are also presented. © 2007 Springer Science+Business Media, LLC.",
    "Affiliations": "Algorithmic Trading Team, Innovating Finances S.A., Valparaíso, Chile; Informatics Department, Santa Maria University, Valparaíso, Chile",
    "Author Keywords": "Kernels; Online classification; Price pattern; Technical analysis; Trading",
    "Author(s) ID": "24511977200;24512035700;9239169100;",
    "Authors": "Cañete A., Constanzo J., Salinas L.",
    "Cited by": 3,
    "DOI": "10.1007/s10489-007-0054-2",
    "Document Type": "Article",
    "EID": "2-s2.0-49049106528",
    "Index Keywords": "Kernels; New approaches; Online classification; Price pattern; Technical analysis; Trading; Trading systems; Commerce",
    "Issue": "2",
    "Page end": 156.0,
    "Page start": 152.0,
    "Source title": "Applied Intelligence",
    "Title": "Kernel price pattern trading",
    "Volume": "29",
    "Year": 2008
  },
  "18": {
    "Abstract": "Portfolio management is a challenging task where humans have to make decisions under uncertainty. Since usually humans tend to avoid unknown risk, in general they don't maximize their utility function when managing a portfolio. This fact favours using an automated trading system for portfolio management. In this work, we propose an automated trading system using multiagent systems. We use fundamental and cluster analysis to select the stocks, and additionally we employ a financial distress prediction model to estimate companies financial health. We also optimize the portfolio for different investor's utility functions. Comparing our approach's results to a benchmark, we have obtained higher return values and lower risks; moreover, the approach was profitable even when we have added brokerage fees. © 2018 IEEE.",
    "Affiliations": "Escola Politécnica, Universidade de Saõ Paulo, Saõ Paulo, Brazil",
    "Author Keywords": "automated trading system; cluster analysis; multiagent systems; portfolio management; portfolio optimization",
    "Author(s) ID": "57205622376;6602534285;",
    "Authors": "Rodrigues Reis E., Simao Sichman J.",
    "Cited by": 0,
    "DOI": "10.1109/BRACIS.2018.00071",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85060855525",
    "Index Keywords": "Automation; Cluster analysis; Commerce; Financial data processing; Intelligent systems; Investments; Multi agent systems; Automated trading systems; Financial distress prediction model; Financial health; Portfolio managements; Portfolio optimization; Return value; Utility functions; Value investing; Financial markets",
    "Issue": null,
    "Page end": 377.0,
    "Page start": 372.0,
    "Source title": "Proceedings - 2018 Brazilian Conference on Intelligent Systems, BRACIS 2018",
    "Title": "MAVIS: A multiagent value investing system",
    "Volume": null,
    "Year": 2018
  },
  "183": {
    "Abstract": "Investment strategies are usually based on forecasting models, and these are optimized with respect to past predictive performance. However, the main goal of most investors is the optimization of a risk-adjusted performance measure, such as the well-known Sharpe index. This issue has been approached by a few different studies within the area of Neurocomputing. The present paper briefly describes and empirically compares some of the models and methods proposed in those studies. Such adaptive methods can be computationally demanding, and convergence to high-quality solutions can be difficult to achieve, yet they can be very useful in automated trading systems, namely for portfolio management. In particular, the Q-learning algorithm, when combined with neural networks for value function approximation, seems to be a reasonably competitive approach, although not overall superior to alternative ones. © 2005 Elsevier B.V. All rights reserved.",
    "Affiliations": "Faculdade de Economia, Universidade Nova de Lisboa, 1099-032 Lisboa, Portugal; Faculdade de Ciências, Universidade de Lisboa, 1749-016 Lisboa, Portugal; Centro de Investigação Operacional, Lisboa, Portugal",
    "Author Keywords": "Dynamic programming; Investment analysis; Neural networks",
    "Author(s) ID": "14627874900;8627277700;",
    "Authors": "Xufre Casqueiro P., Rodrigues A.J.L.",
    "Cited by": 10,
    "DOI": "10.1016/j.ejor.2005.02.015",
    "Document Type": "Article",
    "EID": "2-s2.0-33748923270",
    "Index Keywords": "Algorithms; Dynamic programming; International trade; Investments; Neural networks; Optimization; Automated trading systems; Investment analysis; Q-learning algorithm; Risk-adjusted performance; Operations research",
    "Issue": "3",
    "Page end": 1412.0,
    "Page start": 1400.0,
    "Source title": "European Journal of Operational Research",
    "Title": "Neuro-dynamic trading methods",
    "Volume": "175",
    "Year": 2006
  },
  "187": {
    "Abstract": "This paper introduces adaptive reinforcement learning (ARL) as the basis for a fully automated trading system application. The system is designed to trade foreign exchange (FX) markets and relies on a layered structure consisting of a machine learning algorithm, a risk management overlay and a dynamic utility optimization layer. An existing machine-learning method called recurrent reinforcement learning (RRL) was chosen as the underlying algorithm for ARL. One of the strengths of our approach is that the dynamic optimization layer makes a fixed choice of model tuning parameters unnecessary. It also allows for a risk-return trade-off to be made by the user within the system. The trading system is able to make consistent gains out-of-sample while avoiding large draw-downs. © 2005 Elsevier Ltd. All rights reserved.",
    "Affiliations": "Centre for Financial Research, University of Cambridge, Cambridge Systems Associates Limited, Cambridge, United Kingdom; Centre for Financial Research, Judge Business School, University of Cambridge, Cambridge, United Kingdom",
    "Author Keywords": null,
    "Author(s) ID": "7006125037;11639604300;",
    "Authors": "Dempster M.A.H., Leemans V.",
    "Cited by": 66,
    "DOI": "10.1016/j.eswa.2005.10.012",
    "Document Type": "Article",
    "EID": "2-s2.0-30944465416",
    "Index Keywords": "Algorithms; Commerce; Mathematical models; Parameter estimation; Risk management; Adaptive reinforcement learning (ARL); Dynamic optimization; Foreign exchange (FX); Recurrent reinforcement learning (RRL); Learning systems",
    "Issue": "3",
    "Page end": 552.0,
    "Page start": 543.0,
    "Source title": "Expert Systems with Applications",
    "Title": "An automated FX trading system using adaptive reinforcement learning",
    "Volume": "30",
    "Year": 2006
  },
  "189": {
    "Abstract": "Foreign exchange trading has emerged in recent times as a significant activity in many countries. As with most forms of trading, the activity is influenced by many random parameters, so that the creation of a system that effectively emulates the trading process will be very helpful. This chapter presents a novel trading system using Machine Learning methods of Genetic Algorithms and Reinforcement Learning. The system emulates trader behavior on the Foreign Exchange market and finds the most profitable trading strategy. © 2006, Idea Group Inc.",
    "Affiliations": "School of Information Technology and Electrical Engineering, University of Queensland, Australia",
    "Author Keywords": null,
    "Author(s) ID": "8931771100;56246095000;",
    "Authors": "Hryshko A., Downs T.",
    "Cited by": 0,
    "DOI": "10.4018/978-1-59140-702-7.ch020",
    "Document Type": "Book Chapter",
    "EID": "2-s2.0-84898373586",
    "Index Keywords": null,
    "Issue": null,
    "Page end": 430.0,
    "Page start": 406.0,
    "Source title": "Business Applications and Computational Intelligence",
    "Title": "Development of machine learning software for high frequency trading in financial markets",
    "Volume": null,
    "Year": 2005
  },
  "19": {
    "Abstract": "Quantitative trading is an automated trading system in which the trading strategies and decisions are conducted by a set of mathematical models. Quantitative trading applies a wide range of computational approaches such as statistics, physics, or machine learning to analyze, predict, and take advantage of big data in finance for investment. This work studies core components of a quantitative trading system. Machine learning offers a number of important advantages over traditional algorithmic trading. With machine learning, multiple trading strategies are implemented consistently and able to adapt to real-time market. To demonstrate how machine learning techniques can meet quantitative trading, linear regression and support vector regression models are used to predict stock movement. In addition, multiple optimization techniques are used to optimize the return and control risk in trading. One common characteristic for both prediction models is they effectively performed in short-term prediction with high accuracy and return. However, in short-term prediction, the linear regression model is outperform compared to the support vector regression model. The prediction accuracy is considerably improved by adding technical indicators to dataset rather than adjusted price and volume. Despite the gap between prediction modeling and actual trading, the proposed trading strategy achieved a higher return than the S&P 500 ETF-SPY. © 2018 Association for Computing Machinery.",
    "Affiliations": "Dept. of Computer Science and Information Engineering, National Taipei University of Technology, Taipei, Taiwan",
    "Author Keywords": "Machine learning; Portfolio optimization; Quantitative trading; Stock prediction; Trading strategy",
    "Author(s) ID": "57190807374;8202608200;57204878120;",
    "Authors": "Ta V.-D., Liu C.-M., Addis D.",
    "Cited by": 1,
    "DOI": "10.1145/3287921.3287963",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85059963808",
    "Index Keywords": "Artificial intelligence; Commerce; Forecasting; Investments; Learning algorithms; Learning systems; Regression analysis; Automated trading systems; Linear regression models; Machine learning techniques; Portfolio optimization; Quantitative trading; Stock predictions; Support vector regression models; Trading strategies; Electronic trading",
    "Issue": null,
    "Page end": 105.0,
    "Page start": 98.0,
    "Source title": "ACM International Conference Proceeding Series",
    "Title": "Prediction and portfolio optimization in quantitative trading using machine learning techniques",
    "Volume": null,
    "Year": 2018
  },
  "198": {
    "Abstract": "This study investigates high frequency currency trading with neural networks trained via recurrent reinforcement learning (RRL). We compare the performance of single layer networks with networks having a hidden layer and examine the impact of the fixed system parameters on performance. In general, we conclude that the trading systems may be effective, but the performance varies widely for different currency markets and this variability cannot be explained by simple statistics of the markets. Also we find that the single layer network outperforms the two layer network in this application. © 2003 IEEE.",
    "Affiliations": "Computation and Neural Systems, California Institute of Technology, 139-74, Pasadena, CA  91125, United States",
    "Author Keywords": "Computer networks; Frequency; Gold; History; Learning; Neural networks; Neurons; Recurrent neural networks; Statistics; System testing",
    "Author(s) ID": "9245309500;",
    "Authors": "Gold C.",
    "Cited by": 23,
    "DOI": "10.1109/CIFER.2003.1196283",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-30944437588",
    "Index Keywords": "Artificial intelligence; Commerce; Computer networks; Electronic trading; Financial markets; Gold; History; Network layers; Neural networks; Neurons; Reinforcement learning; Statistics; Currency markets; Currency trading; Frequency; High frequency HF; Learning; Recurrent reinforcement learning; System testing; Two-layer network; Recurrent neural networks",
    "Issue": null,
    "Page end": 370.0,
    "Page start": 363.0,
    "Source title": "IEEE/IAFE Conference on Computational Intelligence for Financial Engineering, Proceedings (CIFEr)",
    "Title": "FX trading via recurrent reinforcement learning",
    "Volume": "2003-January",
    "Year": 2003
  },
  "199": {
    "Abstract": "For building an automatic trading system one needs: a significant variable for characterizing the financial asset behaviours; a suitable algorithm for finding out the information hidden in such a variable; and a proper Trading Strategy for transforming these information in operative indications. Starting from recent results proposed in literature, we have conjectured that the Technical Analysis approach could reasonably extract the information present in prices and volumes. Like tool able to find out the relation existing between the Technical Analysis inputs and an output we properly defined, we use the Group Method of Data Handling, a soft-computing approach which gives back a polynomial approximation of the unknown relationship between the inputs and the output. The automatic Trading Strategy we implement is able both to work in real-time and to return operative signals. The system we create in such a way not only performs pattern recognition, but also generates its own patterns. The results obtained during an intraday operating simulation on the US T-Bond futures is satisfactory, particularly from the point of view of the trend direction detection, and from the net profit standpoint. © 2002 Springer-Verlag Berlin Heidelberg.",
    "Affiliations": "Department of Applied Mathematics, University Ca' Foscari of Venice, Dorsoduro n. 3825/E, 30125 Venice, Italy; T4T S.r.l. - Tools for Trading, via Risorgimento n. 36, 35137 Padua, Italy",
    "Author Keywords": "Automatic trading strategy (or trading system); GMDM; Technical analisys",
    "Author(s) ID": "55108761600;55350684500;55351785200;",
    "Authors": "Corazza M., Vanni P., Loschi U.",
    "Cited by": 2,
    "DOI": null,
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84865760486",
    "Index Keywords": "Financial assets; GMDM; Group method of data handling; Net profits; Technical analisys; Technical analysis; Trading strategies; Trading systems; Direction detections; GMDM; Group method of data handling; Significant variables; Soft computing approaches; Technical analisys; Technical analysis; Trading systems; Data handling; Neural networks; Pattern recognition; Polynomial approximation; Profitability; Commerce; Data handling; Experimental reactors; Neural networks; Pattern recognition; Pattern recognition systems; Polynomial approximation; Soft computing; Commerce; Electronic trading",
    "Issue": null,
    "Page end": 55.0,
    "Page start": 47.0,
    "Source title": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
    "Title": "Hybrid automatic trading systems: Technical analysis & Group Method of Data Handling",
    "Volume": "2486 LNCS",
    "Year": 2002
  },
  "2": {
    "Abstract": "Successful stock traders have been using support-resistance lines for their trading decisions for decades. At the same time, correctly identifying these imaginary lines is one of the greatest challenges that they constantly face due to the complex and mostly inconsistent nature of this phenomenon. Still, these lines are considered among one of the most important technical indicators for designating buy-sell points. It is very difficult, if not impossible to determine the best support-resistance lines for any given stock; hence most of the time, the traders manually draw these imaginary lines on stock charts and implement their trading strategies accordingly. In this study, our aim is automatically identifying these lines through an evolutionary optimization algorithm (PSO) and using these support-resistance points for deciding the optimum buy-sell points. The proposed strategy is compared against Buy Hold. The results indicate using optimized support-resistance lines can be used for identifying buy-sell points, meanwhile if we only decide to use these automatically-generated lines, no significant improvement was observed when compared to Buy Hold strategy. However, this is a preliminary study and more analyses need to be performed. If the model is used as one of the multiple inputs to a more comprehensive trading system along with other technical/fundamental indicators, better results might be achieved. © 2019 IEEE.",
    "Affiliations": "TOBB University of Economics and Technology, Department of Computer Engineering, Ankara, Turkey",
    "Author Keywords": "algorithmic trading; evolutionary algorithms (EA); particle swarm optimization (PSO); Stock market; support-resistance; technical analysis; technical indicators",
    "Author(s) ID": "57215121525;56086517000;6505999525;",
    "Authors": "Yildirim E.O., Ucar M., Ozbayoglu A.M.",
    "Cited by": 0,
    "DOI": "10.1109/UBMYK48245.2019.8965471",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85079231482",
    "Index Keywords": "Commerce; Financial markets; Particle swarm optimization (PSO); Sales; Software engineering; Algorithmic trading; Algorithmic trading system; Automatically generated; Evolutionary optimization algorithm; Support resistance; Technical analysis; Technical indicator; Trading strategies; Electronic trading",
    "Issue": null,
    "Page end": null,
    "Page start": null,
    "Source title": "1st International Informatics and Software Engineering Conference: Innovative Technologies for Digital Transformation, IISEC 2019 - Proceedings",
    "Title": "Evolutionary Optimized Stock Support-Resistance Line Detection for Algorithmic Trading Systems",
    "Volume": null,
    "Year": 2019
  },
  "20": {
    "Abstract": "In this paper, we investigated the profitability of technical analysis as applied to the stock markets of the BRICS member nations. In addition, we searched for evidence that technical analysis and fundamental analysis can complement each other in these markets. To implement this research, we created a comprehensive portfolio containing the assets traded in the markets of each BRICS member. We developed an automated trading system that simulated transactions in this portfolio using technical analysis techniques. Our assessment updated the findings of previous research by including more recent data and adding South Africa, the latest member included in BRICS. Our results showed that the returns obtained by the automated system, on average, exceeded the value invested. There were groups of assets from each country that performed well above the portfolio average, surpassing the returns obtained using a buy and hold strategy. The returns from the sample portfolio were very strong in Russia and India. We also found that technical analysis can help fundamental analysis identify the most dynamic companies in the stock market. © 2018, The Author(s).",
    "Affiliations": "Department of Economics, University of Brasília, Federal District, Brazil; Department of Management, University of Brasília, Federal District, Brazil",
    "Author Keywords": "Automated trading systems; BRICS; Moving average strategies; Portfolio analysis; Technical analysis",
    "Author(s) ID": "57202197252;57205083026;57202190509;16686940900;55939664800;",
    "Authors": "de Souza M.J.S., Ramos D.G.F., Pena M.G., Sobreiro V.A., Kimura H.",
    "Cited by": 10,
    "DOI": "10.1186/s40854-018-0087-z",
    "Document Type": "Article",
    "EID": "2-s2.0-85054272299",
    "Index Keywords": null,
    "Issue": "1",
    "Page end": null,
    "Page start": null,
    "Source title": "Financial Innovation",
    "Title": "Examination of the profitability of technical analysis based on moving average strategies in BRICS",
    "Volume": "4",
    "Year": 2018
  },
  "203": {
    "Abstract": "We have previously described trading systems based on unsupervised learning approaches such as reinforcement learning and genetic algorithms which take as input a collection of commonly used technical indicators and generate profitable trading decisions from them. This article demonstrates the advantages of applying evolutionary algorithms to the reinforcement learning problem using a hybrid credit assignment approach. In earlier work, the temporal difference reinforcement learning approach suffered from problems with overfitting the in-sample data. This motivated the present approach. Technical analysis has been shown previously to have predictive value regarding future movements of foreign exchange prices and this article presents methods for automated high-frequency FX trading based on evolutionary reinforcement learning about signals from a variety of technical indicators. These methods are applied to GBPUSD, USDCHF and USDJPY exchange rates at various frequencies. Statistically significant profits are made consistently at transaction costs of up to 4bp for the hybrid system while the standard RL is only able to trade profitably up to about 1bp slippage per trade. © Springer-Verlag Berlin Heidelberg 2002.",
    "Affiliations": "Centre for Financial Research, Judge Institute of Management, University of Cambridge, United Kingdom",
    "Author Keywords": null,
    "Author(s) ID": "7006125037;6507943425;",
    "Authors": "Dempster M.A.H., Romahi Y.S.",
    "Cited by": 12,
    "DOI": null,
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84947915424",
    "Index Keywords": "Algorithms; Automation; Commerce; Electronic trading; Engineering education; Evolutionary algorithms; Genetic algorithms; Hybrid systems; Learning algorithms; Profitability; Credit assignment; High frequency HF; Predictive values; Reinforcement learning approach; Technical analysis; Technical indicator; Temporal difference reinforcement learning; Transaction cost; Reinforcement learning",
    "Issue": null,
    "Page end": 358.0,
    "Page start": 347.0,
    "Source title": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
    "Title": "Intraday FX trading: An evolutionary reinforcement learning approach",
    "Volume": "2412",
    "Year": 2002
  },
  "211": {
    "Abstract": "Automated trading systems have been proved to be very helpful to traders and investors. However, most of the existing systems implemented with any statistical or neural network approaches are incapable to give accurate advice because they cannot capture the off-market information for which most of it is non-numeric. In this paper, an automated trading system which integrates the techniques from technical analysis, pattern recognition, and knowledge-based system is presented. The numeric data from the stock is processed by both the statistical method and feature extraction. The intermediate results are then used by the rule-based system which captures the off-market information in form of facts and rules. After that, the advice can be generated through the inference with the data stored in the database. For resolving the inconsistencies among the intermediate results from different components of the system. Concepts from the fuzzy set theories are employed. Further, some data from the past Hang Seng Index (HSI) is used for illustration.",
    "Affiliations": "Hong Kong Univ of Science and, Technology, Clear Water Bay, Hong Kong",
    "Author Keywords": null,
    "Author(s) ID": "7402126320;56133124300;",
    "Authors": "Wong Raymond K., Ng Patty N.",
    "Cited by": 3,
    "DOI": null,
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-0028737250",
    "Index Keywords": "Automated trading systems; Hang seng index; Technical analysis; Automation; Database systems; Feature extraction; Fuzzy sets; Inference engines; Knowledge based systems; Statistical methods; Financial data processing",
    "Issue": null,
    "Page end": 282.0,
    "Page start": 278.0,
    "Source title": "Australian and New Zealand Conference on Intelligent Information Systems - Proceedings",
    "Title": "Hybrid approach for automated trading systems",
    "Volume": null,
    "Year": 1994
  },
  "22": {
    "Abstract": "The paper considers the main tendencies of the international currency markets and opportunities for individual investments. The methods of decision support of assets purchasing were provided. A mechanism of intellectual trade with the use of a significant data flow is proposed. Open and closed types of information products were combined to automate the system. Guided by the effectiveness of trade signals assessment, recommendations were made for the use of methods of artificial neural networks or logistic regressions. A set of criteria has been formed to support life cycle of the automated trading system. © 2018 IEEE.",
    "Affiliations": "Faculty of Economics, Department of Economic Cybernetics, Taras Shevchenko National University of Kyiv, Kyiv, Ukraine",
    "Author Keywords": "artificial neural networks; automated trading system; international currency markets; logistic regressions",
    "Author(s) ID": "57194520926;",
    "Authors": "Rybalchenko S.A.",
    "Cited by": 0,
    "DOI": "10.1109/DSMP.2018.8478497",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85056189192",
    "Index Keywords": "Commerce; Decision support systems; Electronic trading; Financial markets; Investments; Life cycle; Neural networks; Regression analysis; Automated trading systems; Automatic systems; Data flow; Decision supports; Information products; International currencies; Logistic regressions; Big data",
    "Issue": null,
    "Page end": 285.0,
    "Page start": 281.0,
    "Source title": "Proceedings of the 2018 IEEE 2nd International Conference on Data Stream Mining and Processing, DSMP 2018",
    "Title": "Big Data Automatic System of Analysis and Trading on Financial Markets",
    "Volume": null,
    "Year": 2018
  },
  "23": {
    "Abstract": "Pairs trading is a statistical arbitrage strategy, which selects a set of assets with similar performance and produces profits during these asset prices far away from rational equilibrium. Once this phenomenon exists, traders can earn the spread by longing the underperforming asset and shorting the outperforming asset. This paper proposed a novel intelligent high-frequency pairs trading system in Taiwan Stock Index Futures (TX) and Mini Index Futures (MTX) market based on deep learning techniques. This research utilized the improved time series visualization method to transfer historical volatilities with different time frames into 2D images which are helpful in capturing arbitrage signals. Moreover, this research improved convolutional neural networks (CNN) model by combining the financial domain knowledge and filterbank mechanism. We proposed Filterbank CNN to extract high-quality features by replacing the random-generating filters with the arbitrage knowledge filters. In summary, the accuracy is enhanced through the proposed method, and it proves that the integrated information technology and financial knowledge could create the better pairs trading system. © 2018 IEEE.",
    "Affiliations": "National Chiao Tung University, Institute of Information Management, Hsinchu, Taiwan; National Chiao Tung University, Department of Information Management and Finance, Hsinchu, Taiwan",
    "Author Keywords": "Deep learning; Filterbank cnn; Pairs trading; Statistical arbitrage; Time series",
    "Author(s) ID": "57195356837;57195360094;8882763200;",
    "Authors": "Chen Y.-Y., Chen W.-L., Huang S.-H.",
    "Cited by": 0,
    "DOI": "10.1109/AGENTS.2018.8459920",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85054528724",
    "Index Keywords": "Commerce; Deep learning; Filter banks; Financial markets; Image enhancement; Neural networks; Time series; Convolutional Neural Networks (CNN); Integrated informations; Learning techniques; Pairs trading; Statistical arbitrage; Stock index futures; Time series visualization; Underperforming assets; Electronic trading",
    "Issue": null,
    "Page end": 116.0,
    "Page start": 113.0,
    "Source title": "Proceedings - 2018 IEEE International Conference on Agents, ICA 2018",
    "Title": "Developing arbitrage strategy in high-frequency pairs trading with filterbank cnn algorithm",
    "Volume": null,
    "Year": 2018
  },
  "24": {
    "Abstract": "Computational intelligence techniques for financial trading systems have always been quite popular. In the last decade, deep learning models start getting more attention, especially within the image processing community. In this study, we propose a novel algorithmic trading model CNN-TA using a 2-D convolutional neural network based on image processing properties. In order to convert financial time series into 2-D images, 15 different technical indicators each with different parameter selections are utilized. Each indicator instance generates data for a 15 day period. As a result, 15 × 15 sized 2-D images are constructed. Each image is then labeled as Buy, Sell or Hold depending on the hills and valleys of the original time series. The results indicate that when compared with the Buy & Hold Strategy and other common trading systems over a long out-of-sample period, the trained model provides better results for stocks and ETFs. © 2018 Elsevier B.V.",
    "Affiliations": "TOBB University of Economics and Technology, Ankara, 06560, Turkey",
    "Author Keywords": "Algorithmic trading; Convolutional neural networks; Deep learning; Financial forecasting; Stock market; Technical analysis",
    "Author(s) ID": "57207586168;6505999525;",
    "Authors": "Sezer O.B., Ozbayoglu A.M.",
    "Cited by": 28,
    "DOI": "10.1016/j.asoc.2018.04.024",
    "Document Type": "Article",
    "EID": "2-s2.0-85048331794",
    "Index Keywords": "Commerce; Convolution; Deep learning; Deep neural networks; Financial markets; Image processing; Neural networks; Time series; Algorithmic trading; Algorithmic trading models; Computational intelligence techniques; Convolutional neural network; Deep convolutional neural networks; Financial forecasting; Financial trading system; Technical analysis; Electronic trading",
    "Issue": null,
    "Page end": 538.0,
    "Page start": 525.0,
    "Source title": "Applied Soft Computing Journal",
    "Title": "Algorithmic financial trading with deep convolutional neural networks: Time series to image conversion approach",
    "Volume": "70",
    "Year": 2018
  },
  "27": {
    "Abstract": "In this paper a novel clustering-based system for automated stock market trading is introduced. It relies on interpolative Boolean algebra as underlying mathematical framework used to construct logical clustering method which is the central component of the system. The system uses fundamental analysis ratios, more precisely market valuation ratios, as clustering variables to differentiate between undervaluated and overvaluated stocks. To structure investment portfolio, the proposed system uses special weighting formulas which automatically diversify investment funds. Finally, a simple trading simulation engine is developed to test our system on real market data. The proposed system was tested on Belgrade Stock Exchange historical data and was able to achieve a high rate of return and to outperform the BelexLine market index as a benchmark variable. The paper has also provided in-depth analysis of the system’s investment decision making process which reveals some exciting insights. © 2018, Strojarski Facultet. All Rights reserved.",
    "Affiliations": "University of Belgrade, Faculty of Organizational Sciences, Jove Ilića 154, Belgrade, 11000, Serbia; University of Istočno Sarajevo, Faculty of Education in Bijeljina, Semberskih ratara bb, Bijeljina, 76300, Bosnia and Herzegovina",
    "Author Keywords": "Automated trading system; Fundamental analysis; Linterpolative boolean algebra; Ogical clustering; Stock market",
    "Author(s) ID": "55505493000;6505880766;7006893714;57203546988;",
    "Authors": "Rakićević A., Simeunović V., Petrović B., Milić S.",
    "Cited by": 1,
    "DOI": "10.17559/TV-20160318145514",
    "Document Type": "Article",
    "EID": "2-s2.0-85045682447",
    "Index Keywords": "Automation; Boolean algebra; Commerce; Decision making; Earnings; Electronic trading; Financial markets; Automated trading systems; Fundamental analysis; Interpolative boolean algebras; Investment decision making; Investment portfolio; Logical clustering; Mathematical frameworks; Ogical clustering; Investments",
    "Issue": "4",
    "Page end": 978.0,
    "Page start": 970.0,
    "Source title": "Tehnicki Vjesnik",
    "Title": "An automated system for stock market trading based on logical clustering",
    "Volume": "25",
    "Year": 2018
  },
  "28": {
    "Abstract": "Some studies suggest that low capitalization stocks have great potential to provide returns above the market average, although some indicate that investment in small caps should be avoided, since they are market anomalies with low liquidity. This article develops a method based on an automated trading system (ATS) applied to the Brazilian stock market, and investigates the relevance of small caps to the investor. The study indicates that, in the case of the Brazilian stock exchange, although there is a possibility of high returns the profitability of technical analysis of small caps is similar to strategies using blue chips. © 2018 Africagrowth Institute",
    "Affiliations": "University of Brasília, Department of Economics, Campus Darcy Ribeiro, Brasília, Federal District  70910-900, Brazil; University of Brasília, Department of Statistics, Campus Darcy Ribeiro, Brasília, Federal District  70910-900, Brazil; University of Brasília, Department of Management, Campus Darcy Ribeiro, Brasília, Federal District  70910-900, Brazil",
    "Author Keywords": "Brazilian stock market; Moving averages; Small caps; Technical analysis",
    "Author(s) ID": "57202197252;57202206587;57202190509;16686940900;55939664800;",
    "Authors": "de Souza M.J.S., Franco Ramos D.G., Pena M.G., Sobreiro V.A., Kimura H.",
    "Cited by": 1,
    "DOI": "10.1016/j.rdf.2018.05.002",
    "Document Type": "Article",
    "EID": "2-s2.0-85047377757",
    "Index Keywords": null,
    "Issue": "1",
    "Page end": 24.0,
    "Page start": 18.0,
    "Source title": "Review of Development Finance",
    "Title": "Do small caps generate above average returns in the Brazilian stock market?",
    "Volume": "8",
    "Year": 2018
  },
  "29": {
    "Abstract": "This paper presents an autonomous effective trading system devoted to the support of decision-making processes in the financial market domain. Genetic programming (GP) has been used effectively as an artificial intelligence technique in the financial field, especially for forecasting tasks in financial markets. In this paper, GP is employed as a means of automatically generating short-term trading rules on financial markets using technical indicators and fundamental parameters. The majority of forecasting tools use a fixed physical timescale, which makes the flow of price fluctuations discontinuous. Therefore, using a fixed physical timescale may expose investors to risks, due to their ignorance of some significant activities. Instead of using fixed timescales for this purpose, the trading rules are generated under a directional-change (DC) event framework. We examine the profitability of the trading systems for the Saudi Stock Exchange, and evaluate the GP forecasting performance under a DC framework through agent-based simulation market index trading. The performance of the forecasting model is compared with a number of benchmark forecasts, namely the buy-and-hold and technical analysis trading strategies. Our numerical results show that the proposed GP model under a DC framework significantly outperforms other traditional models based on fixed physical timescales in terms of portfolio return. © 2018 Infopro Digital Risk (IP) Limited.",
    "Affiliations": "Department of Management Information Systems, College of Business Administration, King Saud University, Riyadh, 12372, Saudi Arabia",
    "Author Keywords": "Automated trading strategy; Decision support tool; Directional changes (DCs); Financial forecasting; Genetic programming (GP)",
    "Author(s) ID": "36674476800;",
    "Authors": "Aloud M.E.",
    "Cited by": 1,
    "DOI": "10.21314/JCF.2018.346",
    "Document Type": "Article",
    "EID": "2-s2.0-85049692016",
    "Index Keywords": null,
    "Issue": "1",
    "Page end": 35.0,
    "Page start": 1.0,
    "Source title": "Journal of Computational Finance",
    "Title": "Investment opportunities forecasting: A genetic programming-based dynamic portfolio trading system under a directional-change framework",
    "Volume": "22",
    "Year": 2018
  },
  "31": {
    "Abstract": "The chapter discusses algorithmic trading, which refers to any automated process, consisting of a number of interconnected components, whose main aim is to perform financial transactions of any kind. Its chief advantage lies in the fact that human intervention is minimized to an acceptable extent. This is quite desirable because nowadays numerous factors affect financial decisions. Financial managers are able to deal with a limited amount of information. There are many ways to implement algorithmic trading systems. This chapter aims to highlight the efficiency of biologically inspired methodologies when incorporated in such systems. Biologically inspired intelligence comprises a range of algorithms whose common philosophy is based on the behavior of real-world, natural systems and networks. What is more, the performance of the applied nature-inspired intelligence (NII) methodologies is compared to traditional benchmark approaches such as the random portfolio construction. © Oxford University Press 2018. All rights reserved.",
    "Affiliations": "Management and Decision Engineering Laboratory, Department of Financial and Management Engineering, University of Aegean, Greece",
    "Author Keywords": "Algorithmic trading; Ant colony optimization; Biologically inspired algorithms; Decisionmaking tools; Genetic algorithms; Portfolio optimization",
    "Author(s) ID": "7004115264;6603714446;",
    "Authors": "Vassiliadis V., Dounias G.",
    "Cited by": 0,
    "DOI": "10.1093/oxfordhb/9780199844371.013.11",
    "Document Type": "Book Chapter",
    "EID": "2-s2.0-85052972628",
    "Index Keywords": "Automation; Benchmarking; Biomimetics; Commerce; Finance; Algorithmic trading; Algorithmic trading system; Amount of information; Biologically inspired; Biologically inspired algorithms; Financial decisions; Financial transactions; Human intervention; Electronic trading",
    "Issue": null,
    "Page end": 310.0,
    "Page start": 295.0,
    "Source title": "The Oxford Handbook of Computational Economics and Finance",
    "Title": "Algorithmic trading based on biologically inspired algorithms",
    "Volume": null,
    "Year": 2018
  },
  "34": {
    "Abstract": "This research seeks to design, implement, and test a fully automatic high-frequency trading system that operates on the Chilean stock market, so that it is able to generate positive net returns over time. A system that implements high-frequency trading (HFT) is presented through advanced computer tools as an NP-Complete type problem in which it is necessary to optimize the profitability of stock purchase and sale operations. The research performs individual tests of the algorithms implemented, reviewing the theoretical net return (profitability) that can be applied on the last day, month, and semester of real market data. Finally, the research determines which of the variants of the implemented system performs best, using the net returns as a basis for comparison. The use of particle swarm optimization as an optimization algorithm is shown to be an effective solution since it is able to optimize a set of disparate variables but is bounded to a specific domain, resulting in substantial improvement in the final solution. © 2018 Broderick Crawford et al.",
    "Affiliations": "Pontificia Universidad Católica de Valparaíso Chile, Avenida Brasil 2241, Valparaíso, 2362807, Chile; Pontificia Universidad Católica de Valparaíso Chile, Avenida Brasil 2830, Valparaíso, 2340031, Chile; Universidad Técnica Federico Santa María Chile, Avenida España 1680, Valparaíso, 2390123, Chile; Universidad Diego Portales Chile, Av. Ejército 441, Santiago, 8370109, Chile",
    "Author Keywords": null,
    "Author(s) ID": "23395875300;24403038600;57204396698;25960662200;7202237871;24773930800;",
    "Authors": "Crawford B., Soto R., San Martín M.A., De La Fuente-Mella H., Castro C., Paredes F.",
    "Cited by": 0,
    "DOI": "10.1155/2018/8721246",
    "Document Type": "Article",
    "EID": "2-s2.0-85055412799",
    "Index Keywords": "Commerce; Financial markets; Particle swarm optimization (PSO); Profitability; Computer tools; Effective solution; High-frequency trading; Net return; NP Complete; Optimization algorithms; Real markets; Electronic trading",
    "Issue": null,
    "Page end": null,
    "Page start": null,
    "Source title": "Scientific Programming",
    "Title": "Automatic High-Frequency Trading: An Application to Emerging Chilean Stock Market",
    "Volume": "2018",
    "Year": 2018
  },
  "35": {
    "Abstract": "Trading the financial markets is a common idea nowadays. Millions of market participants, individuals, companies or public funds are buying and selling different equities in order to obtain profit from the buy and sell price difference. Once the equity was established, the main question marks are when to buy, when to sell and how long to keep the opened positions. This paper will present a mathematical model for the cyclicality of the price evolution. The model can be applied for any equity in any financial market, using any timeframe. The method will gives us information about when is good to buy and when is better to sell. The price cyclicality model is also a method to establish when the price is approaching to change its behavior in order to build limit conditions to stay away the market and to minimize the risk. The fundamental news is already included in the price behavior. Being exclusively a mathematical model based on the price evolution, this method can be easily implemented in algorithmic trading. The paper will also reveal how the cyclicality model can be applied in automated trading systems and will present comparative results obtained in real-time trading environment. © 2018, Bucharest University of Economic Studies. All rights reserved.",
    "Affiliations": "Economic Informatics Doctoral School, The Bucharest University of Economic Studies, Romania",
    "Author Keywords": "Algorithmic trading (AT); Automated trading software (ATS); Financial markets (FM); High frequency trading (HFT); Price cyclicality (PCY)",
    "Author(s) ID": "57205543768;24503667300;",
    "Authors": "Păuna C., Lungu I.",
    "Cited by": 1,
    "DOI": "10.24818/18423264/52.4.18.10",
    "Document Type": "Article",
    "EID": "2-s2.0-85060494115",
    "Index Keywords": null,
    "Issue": "4",
    "Page end": 158.0,
    "Page start": 145.0,
    "Source title": "Economic Computation and Economic Cybernetics Studies and Research",
    "Title": "Price cyclicality model for financial markets. Reliable limit conditions for algorithmic trading",
    "Volume": "52",
    "Year": 2018
  },
  "37": {
    "Abstract": "Modern trading systems are mechanic, run automatically on computers inside trading platforms and decide their position against the market through optimized parameters and algorithmic strategies. These systems now, in most cases, comprise high frequency traders, especially in the Forex market. In this research, a piece of software of an automatic high frequency trading system was developed, based on the technical indicator PIVOT (price level breakthrough). The system made transactions on hourly closing prices with weekly parameters optimization period, using the d-Backtest PS method. Through the search and checking of the results, two findings for optimization of trading strategy were found. These findings with the order they were examined and are presented in this paper are as follows: (1) the simultaneous use of \"long and short\" positions, with different parameters in a hedging account, acts as a hedging strategy, minimizing losses, in relation to a \"long or short\" in a non-hedging account for the same time period and (2) there is weak correlation of past backtesting periods between the same systems, if they are configured for \"long and short\" trades, or for just \"long\" or for just \"short\". © Dimitrios Th. Vezeris, Themistoklis S. Kyrgos, Christos J. Schinas, 2018.",
    "Affiliations": "Department of Electrical and Computer Engineering, Democritus University of Trace, Xanthi, Greece; COSMOS4U, Xanthi, Greece",
    "Author Keywords": "Automated trading; Cotton; D-Backtest; Energy; Gold; Hedging; HFT; PIVOT",
    "Author(s) ID": "57201077778;57215469631;6602792529;",
    "Authors": "Vezeris D.Th., Kyrgos T.S., Schinas C.J.",
    "Cited by": 0,
    "DOI": "10.21511/imfi.15(3).2018.29",
    "Document Type": "Article",
    "EID": "2-s2.0-85064708987",
    "Index Keywords": null,
    "Issue": "3",
    "Page end": 369.0,
    "Page start": 351.0,
    "Source title": "Investment Management and Financial Innovations",
    "Title": "Hedging and non-Hedging trading strategies on commodities using the d-Backtest PS method. Optimized trading system hedging",
    "Volume": "15",
    "Year": 2018
  },
  "38": {
    "Abstract": "This study presents the implementation of an automated trading system that uses three critical analyses to determine time-decisions and portfolios for investment. The approach is based on a meta-grammatical evolution methodology that combines technical, fundamental and macroeconomic analysis on a hybrid top-down paradigm. First, the method provides a low-risk portfolio by analyzing countries and industries. Next, aiming to focus on the most robust companies, the system filters the portfolio by analyzing their economic variables. Finally, the system analyzes prices and volumes to optimize investment decisions during a given period. System validation involves a series of experiments in the European financial markets, which are reflected with a data set of over nine hundred companies. The final solutions have been compared with static strategies and other evolutionary implementations and the results show the effectiveness of the proposal. © 2017, Springer Science+Business Media New York.",
    "Affiliations": "Adaptive and Bioinspired Systems Research Group, Universidad Complutense de Madrid, Madrid, Spain; Institut d’Informática i Aplicacions, Universitat de Girona, Girona, Spain; IE Business School, Madrid, Spain",
    "Author Keywords": "Automated trading systems; Fundamental analysis; Grammatical evolution; Macroeconomic analysis; Meta-GE; Technical analysis",
    "Author(s) ID": "57196804348;7101787656;15758219800;7101931941;",
    "Authors": "Contreras I., Hidalgo J.I., Nuñez-Letamendía L., Velasco J.M.",
    "Cited by": 3,
    "DOI": "10.1007/s10710-017-9304-1",
    "Document Type": "Article",
    "EID": "2-s2.0-85017505827",
    "Index Keywords": "Computational grammars; Investments; Automated trading systems; Fundamental analysis; Grammatical evolution; Macro-economic analysis; Technical analysis; Commerce",
    "Issue": "4",
    "Page end": 431.0,
    "Page start": 411.0,
    "Source title": "Genetic Programming and Evolvable Machines",
    "Title": "A meta-grammatical evolutionary process for portfolio selection and trading",
    "Volume": "18",
    "Year": 2017
  },
  "39": {
    "Abstract": "In current times, trading success depends on choosing a correct strategy. Algorithmic trading is often based on technical analysis - an approach where the values of one or several technical indicators are translated into buy or sell signals. Thus, every trader's main challenge is the choice and use of the most fitting trading rules. In our work, we suggest an evolutionary algorithm for generating and selecting the most fitting trading rules for interday trading, which are presented in the form of binary decision trees. A distinctive feature of this approach is the interpretation of the evaluation of the current state of technical indicators with the help of dynamic ranges that are recalculated on a daily basis. This allows to create long-term trading rules. We demonstrate the effectiveness of this system for the Top-5 stocks of the United States IT sector and discuss the ways to improve it. © 2017 FRUCT.",
    "Affiliations": "Saint-Petersburg State University, Saint-Petersburg, Russian Federation",
    "Author Keywords": null,
    "Author(s) ID": "57195074208;56790445200;",
    "Authors": "Iskrich D., Grigoriev D.",
    "Cited by": 4,
    "DOI": "10.23919/FRUCT.2017.8071297",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85025168054",
    "Index Keywords": "Binary trees; Commerce; Decision trees; Genetic algorithms; Innovation; Trees (mathematics); Algorithmic trading; Binary decision trees; Correct strategy; Dynamic range; Historical data; Technical analysis; Technical indicator; Trading systems; Electronic trading",
    "Issue": null,
    "Page end": 97.0,
    "Page start": 91.0,
    "Source title": "Conference of Open Innovation Association, FRUCT",
    "Title": "Generating long-term trading system rules using a genetic algorithm based on analyzing historical data",
    "Volume": "2017-April",
    "Year": 2017
  },
  "41": {
    "Abstract": "In this paper we propose and validate a trading rule based on flag pattern recognition, incorporating important innovations with respect to the previous research. Firstly, we propose a dynamic window scheme that allows the stop loss and take profit to be updated on a quarterly basis. In addition, since the flag pattern is a trend-following pattern, we have added the EMA indicator to filter trades. This technical analysis indicator is calculated both for 15-min and 1-day timeframes, which enables short and medium terms to be considered simultaneously. We also filter the flags according to the price range on which they are developed and have limited the maximum loss of each trade to 100 points. The proposed methodology was applied to 91,309 intraday observations of the DJIA index, considerably improving the results obtained in the previous proposals and those obtained by the buy & hold strategy, both for profitability and risk, and also after taking into account the transaction costs. These results seem to challenge market efficiency in line with other similar studies, in the specific analysis carried out on the DJIA index and is also limited to the setup considered. © 2017 Elsevier Ltd",
    "Affiliations": "I.U. de Matemàtica Pura i Aplicada, Universitat Politècnica de València, Camí de Vera s/n, Valencia, 46022, Spain",
    "Author Keywords": "Automatic trading; Chart pattern; Exponential moving average; Financial markets; Technical analysis; Trading system",
    "Author(s) ID": "57193775761;57193775758;55962246300;7004199254;",
    "Authors": "Arévalo R., García J., Guijarro F., Peris A.",
    "Cited by": 20,
    "DOI": "10.1016/j.eswa.2017.03.028",
    "Document Type": "Article",
    "EID": "2-s2.0-85016460842",
    "Index Keywords": "Commerce; Costs; Finance; Financial markets; Profitability; Automatic trading; Chart pattern; Exponential moving averages; Technical analysis; Trading systems; Pattern recognition",
    "Issue": null,
    "Page end": 192.0,
    "Page start": 177.0,
    "Source title": "Expert Systems with Applications",
    "Title": "A dynamic trading rule based on filtered flag pattern recognition for stock market price forecasting",
    "Volume": "81",
    "Year": 2017
  },
  "42": {
    "Abstract": "Nowadays, with the rapid development of information technology, many business fields gradually usher in the era of big data. Extracting valuable information from the large data is very urgent. However, because of some limitations such as memory restrictions, data complexity or time complexity, the majority of traditional data mining methods are time consuming and low efficiency working on big data. In contrast, parallel computing is a common and reliable choice to solve that problem. In this paper, we propose a fuzzy rule discovery algorithm - fuzzy rule based classification system in the framework of MapReduce (FRBCS-MR). The proposed FRBCS-MR algorithm applies parallel computing technology to extract fuzzy rules and build fuzzy rule-base, which combines the advantage of dealing with uncertainty of fuzzy system and the ability of MapReduce in parallel computing. Future goods trading has been gradually transformed from the original manual trading to stylized trading and the stylized trading is considered to be the forefront and the most scientific mode of investment. In the experimental studies, the rules extracted by FRBCS-MR algorithm using future goods data are turned into trading strategies which are to be used in the real automated trading platform TradeBlazer (TB) to compute the profit and loss situation. The result shows that the FRBCS-MR algorithm has good profit ability and possesses a certain guiding significance for investors. © 2017 Technical Committee on Control Theory, CAA.",
    "Affiliations": "Research Center of Information and Control, Dalian University of Technology, Dalian, 116024, China",
    "Author Keywords": "Big data; Future goods data; Fuzzy rule based classification system; MapReduce",
    "Author(s) ID": "16029941200;55717309300;57193380007;57193250270;",
    "Authors": "Yang Z., Liu X., Mu Y., Liu X.",
    "Cited by": 0,
    "DOI": "10.23919/ChiCC.2017.8028256",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85032171912",
    "Index Keywords": null,
    "Issue": null,
    "Page end": 5657.0,
    "Page start": 5652.0,
    "Source title": "Chinese Control Conference, CCC",
    "Title": "A parallel fuzzy rule discovery algorithm and future goods automated trading system",
    "Volume": null,
    "Year": 2017
  },
  "43": {
    "Abstract": "Many existing Algorithmic Trading Systems (ATS) use a large number of parameters to improve the results (i.e. accurate market forecasting and maximisation of profit). However, the use of superfluous parameters can often mask underlying trends leading to result instability and an excessive risk. This paper proposes a method for choosing the minimum number of parameters that are necessary and sufficient for the ATS to demonstrate a more reliable outcome. An ATS system is implemented and tested with the method and is shown to be successful for a number of case data scenarios. © 2017 IEEE.",
    "Affiliations": "Department of Computing and Technology, Anglia Ruskin University, East Road, Cambridge, United Kingdom",
    "Author Keywords": null,
    "Author(s) ID": "57195392520;55329325500;7404530373;",
    "Authors": "Milke V., Luca C., Wilson G.",
    "Cited by": 0,
    "DOI": "10.1109/OPTIM.2017.7975121",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85027732112",
    "Index Keywords": "Commerce; Electric machinery; Electronic trading; Oscillators (electronic); Power electronics; Algorithmic trading system; Market forecasting; Minimisation; Optimisations; Electronic equipment",
    "Issue": null,
    "Page end": 1119.0,
    "Page start": 1114.0,
    "Source title": "Proceedings - 2017 International Conference on Optimization of Electrical and Electronic Equipment, OPTIM 2017 and 2017 Intl Aegean Conference on Electrical Machines and Power Electronics, ACEMP 2017",
    "Title": "Minimisation of parameters for optimisation of Algorithmic Trading Systems",
    "Volume": null,
    "Year": 2017
  },
  "44": {
    "Abstract": "Discusses automated trading systems modeling and trading algorithm structure from the perspective of system analysis and automatic control theory principles. We consider various modifications of trading algorithm implementation based on order book imbalance. Using computer simulation of the trading process we demonstrate various ideas and approaches to on-and off-line trading algorithm optimization, adaptation and parameter tuning. © 2017 IEEE.",
    "Affiliations": "Saint Petersburg Electrotechnical University 'Leti', Saint Petersburg, Russian Federation",
    "Author Keywords": "adaptation; algorithmic trading; book imbalance; financial instrument; optimization; order flow",
    "Author(s) ID": "55282267000;6506121003;",
    "Authors": "Imaev D.D., Imaev D.H.",
    "Cited by": 0,
    "DOI": "10.1109/SCM.2017.7970733",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85027157930",
    "Index Keywords": "Automation; Computation theory; Control theory; Optimization; Soft computing; adaptation; Algorithm implementation; Algorithm optimization; Algorithmic trading; Automated trading systems; book imbalance; Order flow; Parameter-tuning; Commerce",
    "Issue": null,
    "Page end": 819.0,
    "Page start": 815.0,
    "Source title": "Proceedings of 2017 20th IEEE International Conference on Soft Computing and Measurements, SCM 2017",
    "Title": "Automated trading systems based on order book imbalance",
    "Volume": null,
    "Year": 2017
  },
  "46": {
    "Abstract": "In this paper, a neural network-based stock price prediction and trading system using technical analysis indicators is presented. The model developed first converts the financial time series data into a series of buy-sell-hold trigger signals using the most commonly preferred technical analysis indicators. Then, a Multilayer Perceptron (MLP) artificial neural network (ANN) model is trained in the learning stage on the daily stock prices between 1997 and 2007 for all of the Dow30 stocks. Apache Spark big data framework is used in the training stage. The trained model is then tested with data from 2007 to 2017. The results indicate that by choosing the most appropriate technical indicators, the neural net- work model can achieve comparable results against the Buy and Hold strategy in most of the cases. Furthermore, fine tuning the technical indicators and/or optimization strategy can enhance the overall trading performance. Copyright 2017 ACM.",
    "Affiliations": "TOBB University of Economics and Technology, Ankara, Turkey; Georgia State University (Adj.), Cankaya University, Ankara, Turkey",
    "Author Keywords": "Algorithmic trading; Artificial neural network; Multi layer perceptron; Stock market; Technical analysis",
    "Author(s) ID": "57207586168;6505999525;6603501593;",
    "Authors": "Sezer O.B., Ozbayoglu A.M., Dogdu E.",
    "Cited by": 14,
    "DOI": "10.1145/3077286.3077294",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85021417788",
    "Index Keywords": "Big data; Commerce; Financial data processing; Financial markets; Network layers; Neural networks; Time series analysis; Algorithmic trading; Artificial neural network models; Buy-and-hold strategy; Financial time series; Multi layer perceptron; Optimization strategy; Stock price prediction; Technical analysis; Electronic trading",
    "Issue": null,
    "Page end": 226.0,
    "Page start": 223.0,
    "Source title": "Proceedings of the SouthEast Conference, ACMSE 2017",
    "Title": "An artificial neural network-based stock trading system using technical analysis and big data framework",
    "Volume": null,
    "Year": 2017
  },
  "49": {
    "Abstract": "This paper describes a hybrid automated trading system (ATS) based on grammatical evolution and microeconomic analysis. The proposed system takes advantage from the flexibility of grammars for introducing and testing novel characteristics. The ATS introduces the self-generation of new technical indicators and multi-strategies for stopping unforeseen losses. Additionally, this work copes with a novel optimization method combining multi-objective optimization with a grammatical evolution methodology. We implemented the ATS testing three different fitness functions under three mono-objective approaches and also two multi-objective ATSs. Experimental results test and compare them to the Buy and Hold strategy and a previous approach, beating both in returns and in number of positive operations. In particular, the multi-objective approach demonstrated returns up to 20 in very volatile periods, proving that the combination of fitness functions is beneficial for the ATS. © 2017 IOS Press and the authors. All rights reserved.",
    "Affiliations": "Universitat de Girona, Spain; Adaptive and Bioinspired Systems Research Group, Universidad Complutense de Madrid, Spain; IE Business School, Madrid, Spain",
    "Author Keywords": "Automatic trading systems; Grammatical evolution; Multi-objective optimization; Stock market; Technical analysis; Time series",
    "Author(s) ID": "57196804348;7101787656;15758219800;",
    "Authors": "Contreras I., Hidalgo J.I., Nuñez-Letamendía L.",
    "Cited by": 4,
    "DOI": "10.3233/JIFS-16435",
    "Document Type": "Article",
    "EID": "2-s2.0-85014264327",
    "Index Keywords": "Commerce; Computational grammars; Financial markets; Time series; Time series analysis; Automated trading systems; Buy-and-hold strategy; Grammatical evolution; Microeconomic analysis; Objective approaches; Technical analysis; Technical indicator; Trading systems; Multiobjective optimization",
    "Issue": "3",
    "Page end": 2475.0,
    "Page start": 2461.0,
    "Source title": "Journal of Intelligent and Fuzzy Systems",
    "Title": "A hybrid automated trading system based on multi-objective grammatical evolution",
    "Volume": "32",
    "Year": 2017
  },
  "51": {
    "Abstract": "The development of computational intelligence based trading strategies for financial markets has been the focus of research over the last few years. To develop efficient and effective automated trading strategies, we need to understand the workings of the market and the patterns emerging as a result of the traders interactions. In this paper, we develop an adaptive Genetic Programming (GP) agent-based trading system under Intraday Seasonality Model (ISM), which is abbreviated as GP-ISM trading system. ISM is used for creating maps and visualizing the dynamic price evolution of the asset during the day. This new model permits the recognition of periodic patterns and seasonalities in the price time series and hence eliminates any unnecessary data input. We use a high-frequency dataset of historical price data from Saudi Stock Market, which enables us to run multiple market simulation runs and draw comparisons and conclusions for the developed trading strategies. The goal of our work is to develop automated computational intelligence-based strategies for real markets, and this study facilitates a more thorough understanding of a specific market's workings and constitutes the basis for further exploration into such strategies designed for the stock market. We evaluate the intelligence of the GP-ISM trading system through agent-based simulation market index trading. For comparison, we also include four other types of trading agents in this contest, namely, zero-intelligence agents, Buy-and-Hold agents, fundamental agents and technical analysis agents. As a result, GP-ISM performs the best, which provides a general framework for the further development of automated trading strategies and decision support systems. © 2017 IOS Press and the authors. All rights reserved.",
    "Affiliations": "Department of Management Information Systems, College of Business Administration, King Saud University, Saudi Arabia",
    "Author Keywords": "Adaptive GP trading system; agent-based model; decision support systems; financial forecasting; high-frequency trading; intraday seasonality model",
    "Author(s) ID": "36674476800;",
    "Authors": "Aloud M.",
    "Cited by": 2,
    "DOI": "10.3233/IDT-170291",
    "Document Type": "Article",
    "EID": "2-s2.0-85025808605",
    "Index Keywords": "Artificial intelligence; Automation; Autonomous agents; Costs; Decision support systems; Electronic trading; Finance; Financial data processing; Financial markets; Genetic algorithms; Genetic programming; Pattern recognition; Planning; Agent-based model; Financial forecasting; High-frequency trading; Seasonality; Trading systems; Commerce",
    "Issue": "2",
    "Page end": 251.0,
    "Page start": 235.0,
    "Source title": "Intelligent Decision Technologies",
    "Title": "Adaptive GP agent-based trading system under intraday seasonality model",
    "Volume": "11",
    "Year": 2017
  },
  "54": {
    "Abstract": "In Complex Event Processing (CEP), complex events are detected according to a set of rules that are defined by domain experts. However, it makes the reliability of the system decreased as dynamic changes occur in the domain environment or domain experts make mistakes. To address such problem, this study proposes a Sequence Clustering-based Automated Rule Generation (SCARG) that can automatically generate rules by mining decision-making history of domain experts based on sequence clustering and probabilistic graphical modeling. Furthermore, based on a two-way learning approach, the proposed method is able to support automated regular or occasional rule updates. It makes self-adaptive CEP system possible by combining the rule generation method and the existing dynamic CEP systems. This technique is verified by establishing an automated stock trading system, and the performance of the system is measured in terms of the rate of return. The study solves the aforementioned problems and shows excellent results with an increase of 19.32% in performance when compared to the existing dynamic CEP technique. © 2016 Elsevier B.V.",
    "Affiliations": "Department of Computer Engineering, Chung-Ang University, Heunseok-Dong, Dongjak-gu, Seoul  156-756, South Korea",
    "Author Keywords": "Automatic rule mining; Complex event processing; Decision making system; Event pattern recognition; Graphical modeling",
    "Author(s) ID": "57150108800;7402896966;",
    "Authors": "Lee O.-J., Jung J.E.",
    "Cited by": 31,
    "DOI": "10.1016/j.future.2016.02.011",
    "Document Type": "Article",
    "EID": "2-s2.0-84960192509",
    "Index Keywords": "Automation; Decision making; Earnings; Electronic trading; Graphic methods; Pattern recognition; Complex event processing; Complex event processing (CEP); Decision-making systems; GraphicaL model; Probabilistic graphical models; Rule generation method; Rule mining; Stock trading system; Pattern recognition systems",
    "Issue": null,
    "Page end": 109.0,
    "Page start": 100.0,
    "Source title": "Future Generation Computer Systems",
    "Title": "Sequence Clustering-based Automated Rule Generation for Adaptive Complex Event Processing",
    "Volume": "66",
    "Year": 2017
  },
  "55": {
    "Abstract": "This is an introductory work to the field of automatizing futures markets, related to commodities, so far operated by human traders. First, we build a mathematical framework for a futures market with many producers and consumers represented by automated traders in the market platform. Then we suggest an automatic trading strategy for the automatons. This strategy takes into account the forecasts of supply and demand streams as well as the evolution of nominal price. Later, we recall a set of analytical criteria used to measure the performance of a trading strategy. Next, we illustrate our approach by showing a price pattern generated by the automatic strategy and calculate its performances. Finally, we exhibit a heuristic based on simulation allowing to compute a quasi-optimal parameters matrix for this automatic trading system. © 2017 by IGI Global. All rights reserved.",
    "Affiliations": "CEVITAL Group, Algeria; Unit Research LaMOS, Algeria",
    "Author Keywords": null,
    "Author(s) ID": "41261978800;8869609600;",
    "Authors": "Laib F., Radjef M.S.",
    "Cited by": 0,
    "DOI": "10.4018/978-1-5225-0997-4.ch020",
    "Document Type": "Book Chapter",
    "EID": "2-s2.0-85016492596",
    "Index Keywords": "Commerce; Financial markets; Commodities market; Mathematical frameworks; Price patterns; Quasi-optimal; Supply and demand; Trading strategies; Trading systems; Electronic trading",
    "Issue": null,
    "Page end": 380.0,
    "Page start": 368.0,
    "Source title": "Handbook of Research on Intelligent Techniques and Modeling Applications in Marketing Analytics",
    "Title": "Operating commodities market by automated traders",
    "Volume": null,
    "Year": 2016
  },
  "56": {
    "Abstract": "Many technical indicators have been selected as input variables in order to develop an automated trading system that determines buying and selling trading decision using optimal trading rules within the futures market. However, optimal technical trading rules alone may not be sufficient for real-world application given the endlessly changing futures market. In this study, a rule change trading system (RCTS) that consists of numerous trading rules generated using rough set analysis is developed in order to cover diverse market conditions. To change the trading rules, a rule change mechanism based on previous trading results is proposed. Simultaneously, a genetic algorithm is employed with the objective function of maximizing the payoff ratio to determine the thresholds of market timing for both buying and selling in the futures market. An empirical study of the proposed system was conducted in the Korea Composite Stock Price Index 200 (KOSPI 200) futures market. The proposed trading system yields profitable results as compared to both the buy-and-hold strategy, and a system not utilizing a genetic algorithm for maximizing the payoff ratio. © 2016 Elsevier Ltd. All rights reserved.",
    "Affiliations": "Department of Engineering Management and Systems Engineering, Missouri University of Science and Technology, 205 Engineering Management, 600 W. 14th Street, Rolla, MO  65409-0370, United States; Department of Engineering Management and Systems Engineering, Missouri University of Science and Technology, 221 Engineering Management, 600 W. 14th Street, Rolla, MO  65409-0370, United States",
    "Author Keywords": "Futures market; Genetic algorithm; Rough set; Rule change trading system",
    "Author(s) ID": "57196171260;54945335700;",
    "Authors": "Kim Y., Enke D.",
    "Cited by": 30,
    "DOI": "10.1016/j.eswa.2016.04.031",
    "Document Type": "Article",
    "EID": "2-s2.0-84965029225",
    "Index Keywords": "Commerce; Financial markets; Genetic algorithms; Rough set theory; Automated trading systems; Buy-and-hold strategy; Empirical studies; Objective functions; Rough set analysis; Technical indicator; Technical trading rules; Trading systems; Electronic trading",
    "Issue": null,
    "Page end": 173.0,
    "Page start": 165.0,
    "Source title": "Expert Systems with Applications",
    "Title": "Developing a rule change trading system for the futures market using rough set analysis",
    "Volume": "59",
    "Year": 2016
  },
  "6": {
    "Abstract": "We study trading systems using reinforcement learning with three newly proposed methods to maximize total profits and reflect real financial market situations while overcoming the limitations of financial data. First, we propose a trading system that can predict the number of shares to trade. Specifically, we design an automated system that predicts the number of shares by adding a deep neural network (DNN) regressor to a deep Q-network, thereby combining reinforcement learning and a DNN. Second, we study various action strategies that use Q-values to analyze which action strategies are beneficial for profits in a confused market. Finally, we propose transfer learning approaches to prevent overfitting from insufficient financial data. We use four different stock indices—the S&P500, KOSPI, HSI, and EuroStoxx50—to experimentally verify our proposed methods and then conduct extensive research. The proposed automated trading system, which enables us to predict the number of shares with the DNN regressor, increases total profits by four times in S&P500, five times in KOSPI, 12 times in HSI, and six times in EuroStoxx50 compared with the fixed-number trading system. When the market situation is confused, delaying the decision to buy or sell increases total profits by 18% in S&P500, 24% in KOSPI, and 49% in EuroStoxx50. Further, transfer learning increases total profits by twofold in S&P500, 3 times in KOSPI, twofold in HSI, and 2.5 times in EuroStoxx50. The trading system with all three proposed methods increases total profits by 13 times in S&P500, 24 times in KOSPI, 30 times in HSI, and 18 times in EuroStoxx50, outperforming the market and the reinforcement learning model. © 2018 Elsevier Ltd",
    "Affiliations": "Department of Financial Engineering, Ajou University, Worldcupro 206, Yeongtong-gu, Suwon, 16499, South Korea; Department of Data Science, Ajou University, Worldcupro 206, Yeongtong-gu, Suwon, 16499, South Korea",
    "Author Keywords": "Deep Q-learning; Reinforcement learning; Stock trading; Trading strategy; Transfer learning",
    "Author(s) ID": "57204061159;57200074208;",
    "Authors": "Jeong G., Kim H.Y.",
    "Cited by": 9,
    "DOI": "10.1016/j.eswa.2018.09.036",
    "Document Type": "Article",
    "EID": "2-s2.0-85054321884",
    "Index Keywords": "Automation; Commerce; Deep neural networks; Electronic trading; Financial markets; Forecasting; Profitability; Automated systems; Automated trading systems; Financial trading; Q-learning; Reinforcement learning models; Stock trading; Trading strategies; Transfer learning; Reinforcement learning",
    "Issue": null,
    "Page end": 138.0,
    "Page start": 125.0,
    "Source title": "Expert Systems with Applications",
    "Title": "Improving financial trading decisions using deep Q-learning: Predicting the number of Shares, action Strategies, and transfer learning",
    "Volume": "117",
    "Year": 2019
  },
  "60": {
    "Abstract": "Recurrent reinforcement learning (RRL) has been found to be a successful machine learning technique for building financial trading systems. In this paper, we use a genetic algorithm (GA) to improve the trading results of a RRL-type equity trading system. The proposed trading system takes the advantage of GA’s capability to select an optimal combination of technical indicators, fundamental indicators and volatility indicators for improving out-of-sample trading performance. In our experiment, we use the daily data of 180 S&P stocks (from the period January 2009 to April 2014) to examine the profitability and the stability of the proposed GA-RRL trading system. We find that, after feeding the indicators selected by the GA into the RRL trading system, the out-of-sample trading performance improves as the number of companies with a significantly positive Sharpe ratio increases. © 2015, Springer Science+Business Media New York.",
    "Affiliations": "Faculty of Economics and Business Administration, University of Basel, Peter Merian-Weg 6, Basel, Switzerland",
    "Author Keywords": "Algorithmic trading; Artificial intelligence; Genetic algorithm; Indicator selection; Recurrent reinforcement learning; Sharpe ratio",
    "Author(s) ID": "55827833100;6505926910;",
    "Authors": "Zhang J., Maringer D.",
    "Cited by": 9,
    "DOI": "10.1007/s10614-015-9490-y",
    "Document Type": "Article",
    "EID": "2-s2.0-84922170738",
    "Index Keywords": null,
    "Issue": "4",
    "Page end": 567.0,
    "Page start": 551.0,
    "Source title": "Computational Economics",
    "Title": "Using a Genetic Algorithm to Improve Recurrent Reinforcement Learning for Equity Trading",
    "Volume": "47",
    "Year": 2016
  },
  "61": {
    "Abstract": "This paper introduces a new probabilistic graphical model called gated Bayesian network (GBN). This model evolved from the need to represent processes that include several distinct phases. In essence, a GBN is a model that combines several Bayesian networks (BNs) in such a manner that they may be active or inactive during queries to the model. We use objects called gates to combine BNs, and to activate and deactivate them when predefined logical statements are satisfied. In this paper we also present an algorithm for semi-automatic learning of GBNs. We use the algorithm to learn GBNs that output buy and sell decisions for use in algorithmic trading systems. We show how the learnt GBNs can substantially lower risk towards invested capital, while they at the same time generate similar or better rewards, compared to the benchmark investment strategy buy-and-hold. We also explore some differences and similarities between GBNs and other related formalisms. © 2015 Elsevier Inc.",
    "Affiliations": "Department of Computer and Information Science, Linköping University, Sweden",
    "Author Keywords": "Algorithmic trading; Bayesian networks; Decision support; Probabilistic graphical models",
    "Author(s) ID": "55302956400;57209300112;",
    "Authors": "Bendtsen M., Peña J.M.",
    "Cited by": 7,
    "DOI": "10.1016/j.ijar.2015.11.002",
    "Document Type": "Article",
    "EID": "2-s2.0-84959420373",
    "Index Keywords": "Algorithms; Commerce; Decision support systems; Electronic trading; Graphic methods; Reconfigurable hardware; Speech recognition; Algorithmic trading; Algorithmic trading system; Bayesian Networks (bns); Decision supports; Investment strategy; Logical statements; Probabilistic graphical models; Semi-automatics; Bayesian networks",
    "Issue": null,
    "Page end": 80.0,
    "Page start": 58.0,
    "Source title": "International Journal of Approximate Reasoning",
    "Title": "Gated Bayesian networks for algorithmic trading",
    "Volume": "69",
    "Year": 2016
  },
  "67": {
    "Abstract": "The paper proposes a new approach to implement common neural network algorithms in the network environment. In our experimental study we have used three different types of neural networks based on Hebb, daline and backpropagation training rules. Our goal was to discover important market (Forex) patterns which repeatedly appear in the market history. Developed classifiers based upon neural networks should effectively look for the key characteristics of the patterns in dynamic data. We focus on reliability of recognition made by the described algorithms with optimized training patterns based on the reduction of the calculation costs. To interpret the data from the analysis we created a basic trading system and trade all recommendations provided by the neural network. © Springer Science+Business Media New York 2015.",
    "Affiliations": "Department of Informatics and Computers, University of Ostrava, Dvořákova 7, Ostrava, 702 00, Czech Republic",
    "Author Keywords": "Automated trading system; Cloud computing; Knowledge discovery; Neural networks; Pattern recognition",
    "Author(s) ID": "57144256000;55925898100;54787895300;",
    "Authors": "Janosek M., Volna E., Kotyrba M.",
    "Cited by": 6,
    "DOI": "10.1007/s10586-015-0491-3",
    "Document Type": "Article",
    "EID": "2-s2.0-84983268146",
    "Index Keywords": "Algorithms; Cloud computing; Commerce; Data mining; Electronic trading; Neural networks; Pattern recognition; Pattern recognition systems; Automated trading systems; Backpropagation training; Calculation cost; Key characteristics; Network environments; Neural network algorithm; Trading systems; Training patterns; Distributed computer systems",
    "Issue": "4",
    "Page end": 1421.0,
    "Page start": 1411.0,
    "Source title": "Cluster Computing",
    "Title": "Knowledge discovery in dynamic data using neural networks",
    "Volume": "18",
    "Year": 2015
  },
  "76": {
    "Abstract": "Gated Bayesian networks (GBNs) are an extension of Bayesian networks that aim to model systems that have distinct phases. In this paper, we aim to use GBNs to output buy and sell decisions for use in algorithmic trading systems. These systems may have several parameters that require tuning, and assessing the performance of these systems as a function of their parameters cannot be expressed in closed form, and thus requires simulation. Bayesian optimisation has grown in popularity as a means of global optimisation of parameters where the objective function may be costly or a black box. We show how algorithmic trading using GBNs, supported by Bayesian optimisation, can lower risk towards invested capital, while at the same time generating similar or better rewards, compared to the benchmark investment strategy buy-and-hold.",
    "Affiliations": "Department of Computer and Information Science, Linköping University, Sweden",
    "Author Keywords": null,
    "Author(s) ID": "55302956400;",
    "Authors": "Bendtsen M.",
    "Cited by": 0,
    "DOI": null,
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84964529020",
    "Index Keywords": "Algorithms; Artificial intelligence; Commerce; Electronic trading; Global optimization; Reconfigurable hardware; Uncertainty analysis; Algorithmic trading; Algorithmic trading system; Closed form; Global optimisation; Investment strategy; Model system; Objective functions; Optimisations; Bayesian networks",
    "Issue": null,
    "Page end": 11.0,
    "Page start": 2.0,
    "Source title": "CEUR Workshop Proceedings",
    "Title": "Bayesian optimisation of gated Bayesian networks for algorithmic trading",
    "Volume": "1565",
    "Year": 2015
  },
  "77": {
    "Abstract": "In 1997, Moody and Wu presented recurrent reinforcement learning (RRL) as a viable machine learning method within algorithmic trading. Subsequent research has shown a degree of controversy with regards to the benefits of incorporating technical indicators in the recurrent reinforcement learning framework. In 1991, Nison introduced Japanese candlesticks to the global research community as an alternative to employing traditional indicators within the technical analysis of financial time series. The literature accumulated over the past two and a half decades of research contains conflicting results with regards to the utility of using Japanese candlestick patterns to exploit inefficiencies in financial time series. In this paper, we combine features based on Japanese candlesticks with recurrent reinforcement learning to produce a high-frequency algorithmic trading system for the E-mini S&P 500 index futures market. Our empirical study shows a statistically significant increase in both return and Sharpe ratio compared to relevant benchmarks, suggesting the existence of exploitable spatio-Temporal structure in Japanese candlestick patterns and the ability of recurrent reinforcement learning to detect and take advantage of this structure in a high-frequency equity index futures trading environment. © 2015 IEEE.",
    "Affiliations": "Department of Information Technology, University of Boras, Sweden",
    "Author Keywords": null,
    "Author(s) ID": "55496136700;7006799558;",
    "Authors": "Gabrielsson P., Johansson U.",
    "Cited by": 4,
    "DOI": "10.1109/SSCI.2015.111",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84964931411",
    "Index Keywords": "Artificial intelligence; Commerce; Financial data processing; Financial markets; Learning systems; Reinforcement learning; Time series; Time series analysis; Algorithmic trading; Algorithmic trading system; Financial time series; Japanese candlesticks; Machine learning methods; Recurrent reinforcement learning; Research communities; Spatio-temporal structures; Electronic trading",
    "Issue": null,
    "Page end": 741.0,
    "Page start": 734.0,
    "Source title": "Proceedings - 2015 IEEE Symposium Series on Computational Intelligence, SSCI 2015",
    "Title": "High-frequency equity index futures trading using recurrent reinforcement learning with candlesticks",
    "Volume": null,
    "Year": 2015
  },
  "79": {
    "Abstract": "This article aims at knowledge discovery in dynamic data via classification based on neural networks. In our experimental study we have used three different types of neural networks based on Hebb, Adaline and backpropagation training rules. Our goal was to discover important market (Forex) patterns which repeatedly appear in the market history. Developed classifiers based upon neural networks should effectively look for the key characteristics of the patterns in dynamic data. We focus on reliability of recognition made by the described algorithms with optimized training patterns based on the reduction of the calculation costs. To interpret the data from the analysis we created a basic trading system and trade all recommendations provided by the neural network. © Springer-Verlag Berlin Heidelberg 2015.",
    "Affiliations": "University of Ostrava, 30. Dubna 22, Ostrava, 70103, Czech Republic",
    "Author Keywords": "Automated trading system; Knowledge discovery; Neural networks; Pattern recognition",
    "Author(s) ID": "55925898100;54787895300;57144256000;",
    "Authors": "Volna E., Kotyrba M., Janosek M.",
    "Cited by": 17,
    "DOI": "10.1007/978-3-662-46578-3_67",
    "Document Type": "Article",
    "EID": "2-s2.0-84923207015",
    "Index Keywords": "Commerce; Data mining; Neural networks; Pattern recognition; ADALINE; Automated trading systems; Backpropagation training; Calculation cost; Dynamic data; Key characteristics; Trading systems; Training patterns; Pattern recognition systems",
    "Issue": null,
    "Page end": 582.0,
    "Page start": 575.0,
    "Source title": "Lecture Notes in Electrical Engineering",
    "Title": "Knowledge discovery in dynamic data using neural networks",
    "Volume": "339",
    "Year": 2015
  },
  "8": {
    "Abstract": "We report successful results from using deep learning neural networks (DLNNs) to learn, purely by observation, the behavior of profitable traders in an electronic market closely modelled on the limit-order-book (LOB) market mechanisms that are commonly found in the real-world global financial markets for equities (stocks shares), currencies, bonds, commodities, and derivatives. Successful real human traders, and advanced automated algorithmic trading systems, learn from experience and adapt over time as market conditions change; our DLNN learns to copy this adaptive trading behavior. A novel aspect of our work is that we do not involve the conventional approach of attempting to predict time-series of prices of tradeable securities. Instead, we collect large volumes of training data by observing only the quotes issued by a successful sales-trader in the market, details of the orders that trader is executing, and the data available on the LOB (as would usually be provided by a centralized exchange) over the period that the trader is active. In this paper we demonstrate that suitably configured DLNNs can learn to replicate the trading behavior of a successful adaptive automated trader, an algorithmic system previously demonstrated to outperform human traders. We also demonstrate that DLNNs can learn to perform better (i.e., more profitably) than the trader that provided the training data. We believe that this is the first ever demonstration that DLNNs can successfully replicate a human-like, or super-human, adaptive trader operating in a realistic emulation of a real-world financial market. Our results can be considered as proof-of-concept that a DLNN could, in principle, observe the actions of a human trader in a real financial market and over time learn to trade equally as well as that human trader, and possibly better. © 2018 IEEE.",
    "Affiliations": "Department of Computer Science, University of Bristol, Bristol, BS8 1UB, United Kingdom",
    "Author Keywords": "Automated Trading; Deep Learning; Financial Engineering; Financial Markets; Intelligent Agents",
    "Author(s) ID": "57207734595;55453739200;",
    "Authors": "Le Calvez A., Cliff D.",
    "Cited by": 6,
    "DOI": "10.1109/SSCI.2018.8628854",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-85056716300",
    "Index Keywords": "Artificial intelligence; Automation; Commerce; Correlation theory; Deep learning; Facsimile; Financial markets; Intelligent agents; Real time systems; Algorithmic trading system; Automated trading; Conventional approach; Electronic market; Financial engineering; Learning neural networks; Market mechanisms; Proof of concept; Electronic trading",
    "Issue": null,
    "Page end": 1883.0,
    "Page start": 1876.0,
    "Source title": "Proceedings of the 2018 IEEE Symposium Series on Computational Intelligence, SSCI 2018",
    "Title": "Deep Learning can Replicate Adaptive Traders in a Limit-Order-Book Financial Market",
    "Volume": null,
    "Year": 2019
  },
  "83": {
    "Abstract": "This paper proposes a performance-driven gradient boosting model (pdGBM) which predicts short-horizon price movements by combining nonlinear response functions of selected predictors. This model performs gradient descent in a constrained functional space by directly minimizing loss functions customized with different trading performance measurements. To demonstrate its practical applications, a simple trading system was designed with trading signals constructed from pdGBM predictions and fixed holding period in each trade. We tested this trading system on the high-frequency data of SPDR S&P 500 index ETF (SPY). In the out-of-sample period, it generated an average of 0.045% return per trade and an annualized Sharpe ratio close to 20 after transaction costs. Various empirical results also showed the model robustness to different parameters. These superior performances confirm the predictability of short-horizon price movements in the US equity market. We also compared the performance of this trading system with similar trading systems based on other predictive models like the gradient boosting model with L2 loss function and the penalized linear model. Results showed that pdGBM substantially outperformed all other models by higher returns in each month of the testing period. Additionally, pdGBM has many advantages including its capability of automatic predictor selection and nonlinear pattern recognition, as well as its simply structured and interpretable output function. © 2015 Taylor & Francis.",
    "Affiliations": "Quest Partners LLC, New York, NY, United States; J.P. Morgan & Co., New York, NY, United States; Lindner College of Business, University of Cincinnati, Cincinnati, OH, United States; College of Economics & Management, Anhui Agricultural University, Hefei Anhui, China",
    "Author Keywords": "Gradient boosting; High-frequency; Systematic trading; TAQ; Trading performance",
    "Author(s) ID": "56717160500;56717067300;52664250700;35747470300;",
    "Authors": "Zhou N., Cheng W., Qin Y., Yin Z.",
    "Cited by": 1,
    "DOI": "10.1080/14697688.2015.1032541",
    "Document Type": "Article",
    "EID": "2-s2.0-84936858019",
    "Index Keywords": null,
    "Issue": "8",
    "Page end": 1403.0,
    "Page start": 1387.0,
    "Source title": "Quantitative Finance",
    "Title": "Evolution of high-frequency systematic trading: a performance-driven gradient boosting model",
    "Volume": "15",
    "Year": 2015
  },
  "85": {
    "Abstract": "Seasonality effects and empirical regularities in financial data have been well documented in the financial economics literature for over seven decades. This paper proposes an expert system that uses novel machine learning techniques to predict the price return over these seasonal events, and then uses these predictions to develop a profitable trading strategy. While simple approaches to trading these regularities can prove profitable, such trading leads to potential large drawdowns (peak-to-trough decline of an investment measured as a percentage between the peak and the trough) in profit. In this paper, we introduce an automated trading system based on performance weighted ensembles of random forests that improves the profitability and stability of trading seasonality events. An analysis of various regression techniques is performed as well as an exploration of the merits of various techniques for expert weighting. The performance of the models is analysed using a large sample of stocks from the DAX. The results show that recency-weighted ensembles of random forests produce superior results in terms of both profitability and prediction accuracy compared with other ensemble techniques. It is also found that using seasonality effects produces superior results than not having them modelled explicitly. © 2013 Elsevier Ltd. All rights reserved.",
    "Affiliations": "Electronics and Computer Science, University of Southampton, SO17 1BJ, United Kingdom; Southampton Management School, University of Southampton, SO17 1BJ, United Kingdom",
    "Author Keywords": "Algorithmic trading; Ensemble learning; Machine learning; Random forests; Stock price prediction",
    "Author(s) ID": "55986802700;6508139443;57203348818;",
    "Authors": "Booth A., Gerding E., McGroarty F.",
    "Cited by": 47,
    "DOI": "10.1016/j.eswa.2013.12.009",
    "Document Type": "Article",
    "EID": "2-s2.0-84891714796",
    "Index Keywords": "Algorithmic trading; Automated trading systems; Empirical regularities; Ensemble learning; Machine learning techniques; Random forests; Regression techniques; Stock price prediction; Decision trees; Economics; Expert systems; Forecasting; Learning systems; Profitability; Commerce",
    "Issue": "8",
    "Page end": 3661.0,
    "Page start": 3651.0,
    "Source title": "Expert Systems with Applications",
    "Title": "Automated trading with performance weighted random forests and seasonality",
    "Volume": "41",
    "Year": 2014
  },
  "86": {
    "Abstract": "The construction of automated financial trading systems (FTSs) is a subject of high interest for both the academic environment and the financial one due to the potential promises by self-learning methodologies. In this paper we consider Reinforcement Learning (RL) type algorithms, that is algorithms that real-time optimize their behavior in relation to the responses they get from the environment in which they operate, without the need for a supervisor. In particular, first we introduce the essential aspects of RL which are of interest for our purposes, second we present some original automatic FTSs based on differently configured RL-based algorithms, then we apply such FTSs to artificial and real time series of daily stock prices. Finally, we compare our FTSs with a classical one based on Technical Analysis indicators. All the results we achieve are generally quite satisfactory. © Springer International Publishing Switzerland 2014.",
    "Affiliations": "Department of Economics, Ca' Foscari University of Venice, Italy; Advanced School of Economics of Venice, Sestiere Cannaregio n. 873, 30121 Venice, Italy",
    "Author Keywords": "Financial time series; Financial trading system; Kernel-based Reinforcement Learning algorithm; Q-learning algorithm; Reinforcement Learning; Stochastic control; Technical Analysis",
    "Author(s) ID": "23388106600;55108761600;",
    "Authors": "Bertoluzzo F., Corazza M.",
    "Cited by": 0,
    "DOI": "10.1007/978-3-319-04129-2_20",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84897874881",
    "Index Keywords": "Financial time series; Financial trading system; Q-learning algorithms; Stochastic control; Technical analysis; Commerce; Finance; Financial data processing; Learning algorithms; Neural networks; Signaling; Reinforcement learning",
    "Issue": null,
    "Page end": 213.0,
    "Page start": 197.0,
    "Source title": "Smart Innovation, Systems and Technologies",
    "Title": "Reinforcement Learning for automated financial trading: Basics and applications",
    "Volume": "26",
    "Year": 2014
  },
  "88": {
    "Abstract": "Nowadays, the increased level of uncertainty in various sectors has posed great burdens in the decision-making process. In the financial domain, a crucial issue is how to properly allocate the available amount of capital, in a number of provided assets, in order to maximize wealth. Automated trading systems assist the aforementioned process to a great extent. In this paper, a basic type of such a system is presented. The aim of the study focuses on the behavior of this system in changes to its parameter settings. A number of independent simulations have been conducted, for the various parameter settings, and distributions of profits/losses have been acquired, leading to interesting concluding remarks. © 2014 Springer International Publishing.",
    "Affiliations": "Management and Decision Engineering Laboratory, Department of Financial and Management Engineering, University of the Aegean, 41 Kountouriotou Str., GR-82100, Greece",
    "Author Keywords": "ant colony optimization; automated trading system; distributional analysis; technical indicators",
    "Author(s) ID": "7004115264;6603714446;",
    "Authors": "Vassiliadis V., Dounias G.",
    "Cited by": 0,
    "DOI": "10.1007/978-3-319-07064-3_21",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84900526676",
    "Index Keywords": "Ant colony optimization; Artificial intelligence; Commerce; Automated trading; Automated trading systems; Decision making process; distributional analysis; Financial domains; Intelligent techniques; Parameter setting; Technical indicator; Automation",
    "Issue": null,
    "Page end": 272.0,
    "Page start": 264.0,
    "Source title": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
    "Title": "Nature-inspired intelligent techniques for automated trading: A distributional analysis",
    "Volume": "8445 LNCS",
    "Year": 2014
  },
  "89": {
    "Abstract": "In the last few years, the financial industry has witnessed a growing demand for an integrated multi-asset, multi-strategy trading system that allows traders to simultaneously trade different types of assets, and provides real-time risk assessments, status, and performance of the diversified portfolio. However, many factors contribute to the complexity of developing such integrated decision-making systems. Some of these factors include: the inherent diversity of financial assets, the heterogeneity of trading and risk assessment strategies, and the highly dynamic nature of financial markets. Moreover, the large volume of data to be analyzed severely affects the system's ability to make timely decisions, especially, for high-frequency trading. This paper proposes a novel Holonic Intelligent Multi-Agent Algorithmic Trading System (HIMAATS) to address the software functional requirements (multi-asset, multi-strategy, real-time risk assessment, etc.), and non-functional requirements (autonomy, high-throughput, low-latency, modularity, scalability, etc.). ISCA Copyright © 2014.",
    "Affiliations": "University of Waterloo, Waterloo, ON  N2L 3G1, Canada; Electrical and Computer Engineering Department, 200 University Avenue West, Canada",
    "Author Keywords": "Algorithmic trading systems; Holonic systems; Multi-agent systems; Multi-asset trading; Multi-strategy trading",
    "Author(s) ID": "56039485400;7004108940;",
    "Authors": "Abdunabi T., Basir O.",
    "Cited by": 0,
    "DOI": null,
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84922323817",
    "Index Keywords": null,
    "Issue": "1",
    "Page end": 61.0,
    "Page start": 54.0,
    "Source title": "International Journal of Computers and their Applications",
    "Title": "Holonic Intelligent Multi-Agent Algorithmic Trading System (HIMAATS)",
    "Volume": "21",
    "Year": 2014
  },
  "9": {
    "Abstract": "Automated trading, which is also known as algorithmic trading, is a method of using a predesigned computer program to submit a large number of trading orders to an exchange. It is substantially a real-time decision-making system which is under the scope of Enterprise Information System (EIS). With the rapid development of telecommunication and computer technology, the mechanisms underlying automated trading systems have become increasingly diversified. Considerable effort has been exerted by both academia and trading firms towards mining potential factors that may generate significantly higher profits. In this paper, we review studies on trading systems built using various methods and empirically evaluate the methods by grouping them into three types: technical analyses, textual analyses and high-frequency trading. Then, we evaluate the advantages and disadvantages of each method and assess their future prospects. © 2018, © 2018 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group.",
    "Affiliations": "School of Information Science and Technology, Shanghai Institute of Intelligent Electronics and Systems, Fudan University, Shanghai, China; School of ICT, KTH Royal Institute of Technology, Kista, Sweden; Old Dominion University, Norfolk, VA, United States",
    "Author Keywords": "algorithmic trading; hardware implementation; high frequency trading; machine learning; statistics; Survey",
    "Author(s) ID": "57204976189;56715227000;13408889400;7403406401;23096694900;",
    "Authors": "Huang B., Huan Y., Xu L.D., Zheng L., Zou Z.",
    "Cited by": 4,
    "DOI": "10.1080/17517575.2018.1493145",
    "Document Type": "Review",
    "EID": "2-s2.0-85058227759",
    "Index Keywords": "Artificial intelligence; Automation; Computer hardware; Decision making; Electronic trading; Hardware; Learning systems; Statistics; Surveying; Surveys; Algorithmic trading; Automated trading systems; Enterprise information system; Hardware implementations; High-frequency trading; Machine learning methods; Real time decision-making; Telecommunication and computer technologies; Commerce",
    "Issue": "1",
    "Page end": 144.0,
    "Page start": 132.0,
    "Source title": "Enterprise Information Systems",
    "Title": "Automated trading systems statistical and machine learning methods and hardware implementation: a survey",
    "Volume": "13",
    "Year": 2019
  },
  "90": {
    "Abstract": "Professional fund managers, investment banks and regulatory authorities raise the question about the impact of algorithmic trading on trading businesses, economy and market efficiency. The questions rise if high frequency trading (HFT) provides more efficient, liquid markets and is economically beneficial. In this paper an algorithm based on statistical arbitrage is tested. Statistical arbitrage is a well-known trading strategy where profit arises from pricing inefficiencies between correlated financial instruments. An algorithm of statistical arbitrage tries to find a pair of correlated instruments that move together and take long/short positions when they diverge abnormally, hoping that the prices will converge in the near future. Recent computational expansion in financial modeling and the ever increasing demand for order execution speed is moving market making and price discovery strategies into high frequency trading (HFT) or the milliseconds realm, where HFT already generates nearly 2/3 of the overall trading volume. In this report we apply high frequency data from NYMEX exchange to test a trading system based on statistical arbitrage in one of the most liquid futures market, i.e. natural gas futures. The overall results suggest that statistical arbitrage in HFT environment significantly outperforms traditional trading strategies, provides liquidity to the markets and denies the efficient market hypothesis. © Vilnius University, 2002-2014 © Brno University of Technology, 2002-2014 © University of Latvia, 2002-2014.",
    "Affiliations": "Department of Informatics, Kaunas Faculty of Humanities, Vilnius University, Muitines str. 8, Kaunas, LT-44280, Lithuania",
    "Author Keywords": "Algorithmic trading; Efficient market hypothesis; Futures market; High frequency trading; Pairs trading; Statistical arbitrage",
    "Author(s) ID": "55447792100;6504396149;14054982600;56527190200;",
    "Authors": "Driaunys K., Masteika S., Sakalauskas V., Vaitonis M.",
    "Cited by": 4,
    "DOI": null,
    "Document Type": "Article",
    "EID": "2-s2.0-84923377438",
    "Index Keywords": null,
    "Issue": "3",
    "Page end": 109.0,
    "Page start": 96.0,
    "Source title": "Transformations in Business and Economics",
    "Title": "An algorithm-based statistical arbitrage high frequency trading system to forecast prices of natural gas futures",
    "Volume": "13",
    "Year": 2014
  },
  "91": {
    "Abstract": "Gated Bayesian networks (GBNs) are a recently introduced extension of Bayesian networks that aims to model dynamical systems consisting of several distinct phases. In this paper, we present an algorithm for semi-automatic learning of GBNs. We use the algorithm to learn GBNs that output buy and sell decisions for use in algorithmic trading systems. We show how using the learnt GBNs can substantially lower risks towards invested capital, while at the same time generating similar or better rewards, compared to the benchmark investment strategy buy-and-hold. © Springer International Publishing Switzerland 2014.",
    "Affiliations": "Department of Computer and Information Science, Linköping University, Sweden",
    "Author Keywords": "Algorithmic trading; Bayesian networks; Decision support; Probabilistic graphical models",
    "Author(s) ID": "55302956400;57209300112;",
    "Authors": "Bendtsen M., Peña J.M.",
    "Cited by": 4,
    "DOI": null,
    "Document Type": "Article",
    "EID": "2-s2.0-84921323477",
    "Index Keywords": "Algorithms; Commerce; Decision support systems; Dynamical systems; Electronic trading; Graphic methods; Algorithmic trading; Algorithmic trading system; Decision supports; Investment strategy; Probabilistic graphical models; Semi-automatics; Bayesian networks",
    "Issue": null,
    "Page end": 64.0,
    "Page start": 9.0,
    "Source title": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
    "Title": "Learning gated bayesian networks for algorithmic trading",
    "Volume": "8754",
    "Year": 2014
  },
  "93": {
    "Abstract": "Recurrent reinforcement learning (RRL) is a machine learning algorithm which has been proposed by researchers for constructing financial trading platforms. When an analysis of RRL trading performance is conducted using low frequency financial data (e.g. daily data), the weakening autocorrelation in price changes may lead to a decrease in trading profits as compared to its applications in high frequency trading. There therefore is a need to improve RRL for the purposes of daily equity trading. This paper presents two parameter update schemes (the 'average elitist' and the 'multiple elitist') for RRL. The purpose of the first scheme is to improve out-of-sample performance of RRL-type trading systems. The second scheme aims to exploit serial dependence in stock returns to improve trading performance, when traders deal with highly correlated stocks. Profitability and stability of the trading system are examined by using four groups of S&P stocks for the period January 2009 to December 2012. It is found that the Sharpe ratios of the stocks increase after we use the two parameter update schemes in the RRL trading system. © 2014 IEEE.",
    "Affiliations": "Faculty of Business and Economics, University of Basel, Peter Merian-Weg 6CH-4002, Switzerland",
    "Author Keywords": null,
    "Author(s) ID": "55827833100;6505926910;",
    "Authors": "Zhang J., Maringer D.",
    "Cited by": 2,
    "DOI": "10.1109/CEC.2014.6900330",
    "Document Type": "Conference Paper",
    "EID": "2-s2.0-84908594427",
    "Index Keywords": "Artificial intelligence; Investments; Learning algorithms; Profitability; Reinforcement learning; Financial data; Financial trading; High-frequency trading; Highly-correlated; ITS applications; Recurrent reinforcement learning; Serial dependence; Trading systems; Commerce",
    "Issue": null,
    "Page end": 1453.0,
    "Page start": 1449.0,
    "Source title": "Proceedings of the 2014 IEEE Congress on Evolutionary Computation, CEC 2014",
    "Title": "Two parameter update schemes for recurrent reinforcement learning",
    "Volume": null,
    "Year": 2014
  },
  "94": {
    "Abstract": "This chapter addresses the topic of automated day trading systems based on artificial neural networks and multi-timeframe technical indicators, a very common market analysis technique. After we introduce the context of this study and give a short overview of day trading, we set out our approach and methodological framework. Then, we present the results obtained through these procedures on several of the most liquid stocks in the Romanian stock market. The final section of the chapter concludes the study and brings some insight about possible future work in the area. © 2014 Springer International Publishing Switzerland.",
    "Affiliations": "Babes-Bolyai University, Cluj-Napoca, Romania",
    "Author Keywords": "Automatic trading; Day trading systems; Market forecast; Multi-time frame technical analysis; Neural networks",
    "Author(s) ID": "55848727500;",
    "Authors": "Stan A.",
    "Cited by": 0,
    "DOI": "10.1007/978-3-319-00467-9_16",
    "Document Type": "Article",
    "EID": "2-s2.0-84958528954",
    "Index Keywords": null,
    "Issue": null,
    "Page end": 200.0,
    "Page start": 191.0,
    "Source title": "Studies in Computational Intelligence",
    "Title": "Day trading the emerging markets using multi-time frame technical indicators and artificial neural networks",
    "Volume": "486",
    "Year": 2014
  },
  "99": {
    "Abstract": "In this paper, we present steps towards a model-driven financial decision support system (FDSS) to pricing options on currency futures, which can be embedded in a high-frequency trading process. Due to the difficulty of option valuation, we provide an alternative heuristic option pricing approach with neural networks. We show that the use of neural networks is not only suitable in generating accurate trading signals, but also in generating automated fast run-time trading signals for the decision taker. To achieve this, we conduct an experiment with an empirical tick data set of EUR/USD options on currency futures of four weeks. An essential advantage of our approach is the simultaneous pricing across different strike prices and parsimonious use of input variables. Nevertheless, we also have to take particular limitations into account, which give us useful hints for further research and steps. Copyright © 2014 Inderscience Enterprises Ltd.",
    "Affiliations": "Institute of Information Systems Research, Gottfried Wilhelm Leibniz Universität, Königsworther Platz 1, 30167 Hannover, Germany",
    "Author Keywords": "Design science; FDSS; Financial decision support system; High-frequency data; Neural networks; Option pricing; Trading systems",
    "Author(s) ID": "55801528600;8947545100;6602910157;",
    "Authors": "Von Spreckelsen C., Von Mettenheim H.-J., Breitner M.H.",
    "Cited by": 0,
    "DOI": "10.1504/IJADS.2014.063228",
    "Document Type": "Article",
    "EID": "2-s2.0-84903946112",
    "Index Keywords": "Artificial intelligence; Commerce; Costs; Decision support systems; Design; Neural networks; Design science; FDSS; Financial decision support systems; High frequency data; Option pricing; Trading systems; Economics",
    "Issue": "3",
    "Page end": 238.0,
    "Page start": 223.0,
    "Source title": "International Journal of Applied Decision Sciences",
    "Title": "Steps towards a high-frequency financial decision support system to pricing options on currency futures with neural networks",
    "Volume": "7",
    "Year": 2014
  }
}